{
    "FNAF": [],
    "Minecraft": [
        {
            "title": "Tales of an 8-BIT Kitten (Lost in the Nether) - Copy",
            "content": "This edition © 2018 by Andrews McMeel Publishing. All rights reserved. No part\nof this book may be used or reproduced in any manner whatsoever without\nwritten permission except in the case of reprints in the context of reviews.\nPublished in French under the title Un Chaton Qui S’est Perdu dans le Nether ©\n2017 by 404 éditions, an imprint of Édi8, Paris, France Text © 2015 by Cube\nKid, Illustration © 2016 by Vladimir “ZloyXP” Subbotin\nMinecraft is a Notch Development AB registered trademark. This book is a work\nof ﬁction and not an oﬃcial Minecraft product, nor approved by or associated\nwith Mojang. The other names, characters, places, and plots are either\nimagined by the author or used ﬁctitiously.\nAndrews McMeel Publishing\na division of Andrews McMeel Universal\n1130 Walnut Street, Kansas City, Missouri 64106\nwww.andrewsmcmeel.com\nISBN: 978-1-4494-9974-7\nLibrary of Congress Control Number: 2018932587\nATTENTION: SCHOOLS AND BUSINESSES\nAndrews McMeel books are available at quantity discounts with bulk purchase\nfor educational, business, or sales promotional use. For information, please e-\nmail the Andrews McMeel Publishing Special Sales Department:\nspecialsales@amuniversal.com.\nIn memory of Lola Salines (1986–2015),\nfounder of 404 éditions and editor of this series,\nwho lost her life in the November 2015 attacks on Paris.\nThank you for believing in me.\n—Cube Kid\nEeebs was a naughty little kitten. Very\nnaughty, in fact. He never listened to his mother.\nShe always told him: “Don’t go too far into the forest, Son.\nIt’s dangerous. And if you ever see a purple light …\nrun away. Run as fast as you can.”\nBut Eeebs loved exploring the woods. He didn’t think the\nforest was dangerous at all. No, it was an\ninteresting place. Interesting and mysterious.\nHe went there at least once a week—like today—along with\nhis closest friends, Tufty and Meowz. The three of them\nhad found a new meadow to play in. The meadow was ﬁlled\nwith all kinds of beautiful ﬂowers. They were\nracing to see who could pick the most.\nEeebs watched Meowz and Tufty ﬁght over a lovely blue\norchid. At last, Meowz tripped Tufty, who went\ntumbling into the grass. Then, she hurried to pick the\norchid before he could get back up.\n“Hey!” Tufty hissed. “Not fair!”\n“Well, you never said no tripping,” she said.\nTufty only ﬂattened his ears and glared at her.\nShe presented her colorful collection, fanned out\nlike a rainbow. “Look at all these ﬂowers,” she said, beaming\nlike the square sun. “I guess that means I win, huh?”\n“Whatever,” said Tufty. He threw his clump of dandelions\nonto the ground. “It was a stupid game, anyway.”\n“I agree,” said Eeebs. “I’m bored. Maybe we should\njust head back?”\n“You can’t be serious,” said Meowz.\nTufty stepped forward. “We’re not gonna get caught again,\nokay?”\n“I know,” said Eeebs. “But—”\n“Look,” said Tufty. “The only reason our parents don’t\nwant us playing here is because they’re jealous. They\ncan’t stand us kittens having so much fun.”\n“He’s right,” said Meowz. “I mean, have you ever seen\nany zombies around here? The truth is they just\ncooked up that \nstory to keep us closer to home. Easier to make us do\nchores that way.”\nEeebs sighed. Maybe they were right. And anyway, the\nforest really was the best place to play in. There were so\nmany mysteries just waiting to be discovered.\n“Fine,” he said. “How about we go play some hide-\nand-seek?” The other two patted him on the back.\n“Now you’re talking!”\n“Yeah! That’s the Eeebs I know!”\nBut Eeebs had no idea how much this suggestion\nwas going to aﬀect him. He could have seen those dark rain\nclouds in the distance as a sign of things to come. Or\nthe chilly breeze that blew through the meadow just then …\nHe didn’t, though. Eeebs was just thinking about how\nfun this day was going to be. A day of playing and\nexploring. And misbehaving.\nThe three kittens began their new game.\n“I think you should go ﬁrst,” Tufty said.\n“Why me?” Eeebs asked.\n“Because this was your idea, silly.”\nEeebs nodded. He didn’t mind. He liked being it way more\nthan he liked hiding. And he knew the real reason why\nTufty wanted to hide: he liked sitting around, doing nothing.\nHe was a bit out of shape and already out of breath after all\nof that ﬂower collecting.\nAs Tufty lumbered oﬀ into the bushes, Meowz smirked at\nEeebs.\n“I almost feel sorry for you,” she purred. “I know the\nultimate hiding spot. You’re gonna be searching\nforever.”\nEeebs ﬂicked his tail. “I like a challenge.”\nA real challenge. He wasn’t going to be\ndisappointed…\nHe waited for Meowz to scamper oﬀ before starting to\ncount.\nHe reached twenty, called out, and began the hunt. Eeebs\nbounded through the hills, through the trees. He peeked in\nevery crevice, every clump of tall grass. He raced up and\ndown all the nearby valleys.\nBut he never found them, not even Tufty, who was\nnormally easy to ﬁnd. Were they hiding together?\nYes, Eeebs thought. Meowz must have felt sorry for him\nand taken him into her fantastic hiding spot.\nHe searched and searched to no avail. Perhaps twenty\nminutes passed, then thirty. The ﬁrst drop of rain hit\nEeebs square on the nose. It started pouring soon\nafter.\nGrandpa said it was just going to sprinkle, he thought. This\nis some sprinkle! At this rate, I’ll need a boat! What\nhappened next sent a shiver down his spine. He walked\nthrough some tall ferns … and found himself standing at the\nedge of a mountainous biome.\nI’m . . .\non the other side of the forest.\nHe had never been this far away from home before. He\nwas so focused on ﬁnding them that he hadn’t paid\nattention to his surroundings. He was lost.\n“Hey!” he called out. “I give up! Guys?”\nHis thin voice was drowned out by the torrential rain.\nEven if his friends were nearby, they wouldn’t have been\nable to hear him. And they weren’t nearby. Eeebs was\nsure of that. They were smart. They never would\nhave gone this far.\nI’m smart too, Eeebs thought. I’ll ﬁgure something out. I\ncan just follow the edge of the forest. Yeah, as long as I stick\nto the edge, I’ll end up home on the other side. Right?\nHe paused. But what about Tufty and Meowz? Are they\nlooking for me right now? Or are they still waiting for me? I\ncan’t just leave them. What should I do?\nThe rain grew heavier. Eeebs began shivering.\nHe decided to go back into the forest and look for them. It\nwas the right thing to do. With a sinking feeling\nin his heart, he turned back to the mountains one last time.\nA ﬂash of lightning suddenly lit up the gray expanse,\nrevealing … wolves.\nThey were moving slowly toward him. His heart sank\neven deeper. If he had seen them, they must’ve\nseen him, too. Then he heard a howl.\nHis heart was no longer sinking. It was pounding\nwildly, jumping into his throat.\nSo he started running. He ran fast, very fast. Eeebs had\nalways been good at running, but he’d never run faster\nin his life. Trees blurred past. Blind panic set in. He\nhad no idea where he was going and didn’t care, as long\nas it was away from those howls and snarls. Yet no\nmatter how fast he went, the sounds stayed behind him.\nWolves could run fast, too.\nVery fast.\nEeebs dashed into a thicket. Cries echoed through the\ntrees. He could hear the wolves snuﬄing, sniﬃng,\nsearching for his scent. That was when he noticed a\npurple glow coming from farther in the thicket. He\nturned away and crept closer to the light.\nTo a kitten like him, it looked like a screen of\nviolet water … \nﬂoating in the air … framed in black stone. For a\nmoment, he forgot about the wolves completely. He\ndidn’t understand what he was looking at. He had never\nseen anything like this before. Well, the humans made\nthings that resembled it called … doors, but this was\nsomething diﬀerent. Whatever it was, it was very\nold. It seemed as if the forest had grown up around the\nstrange object.\nWas this the purple light his mother had warned\nhim of? It didn’t seem that dangerous. The light\nglowed in a calm way. Gentle, even. For some reason,\nEeebs felt he should approach it. It was almost as if the\ndoorway was calling to him, inviting him to come closer.\nAnd why shouldn’t he? By now, those mangy mutts\nwere just outside the thicket. Anything was better than\nfacing them. And the light was so warm. Warmer than\nany sunlight. Warmer than the furnace he had slept on that\ntime he snuck into a farmer’s house. As Eeebs drew closer,\nthe heat washed over him, removing the rain’s\ndamp chill.\nThen, three wolves burst through the\nundergrowth.\nThey stopped upon noticing the light. Their snarls\nturned to whimpers, soft whines. After some\nhesitation, they began growling again, their red eyes ﬁxed\non Eeebs as they slunk slowly forward. He was an\neasy dinner, after all. Those wolves must’ve seen far\nworse than a violet glow.…\nEeebs backed up, right next to the light. Heat waves\nblurred his vision. He felt the light behind him,\npulling him closer. He thought about his\nfriends. He hoped they’d make it back safely. He was\nsure they would. Meowz always knew how to ﬁnd her\nway home.\nThat was his last thought before\ndiving into the screen of light.\nHis vision became blurry, and suddenly he saw only\ndarkness.\nEeebs would never be a normal cat again.\nHis days of climbing trees and swatting at\nbutterﬂies were over. Stories would spread among the\nvillages, stories of a strange kitten with blue fur and\nviolet eyes.\nHe hadn’t listened to his mom.\nHe’d ventured into the Nether.\nEeebs felt nothing for several seconds. Nothing except\nhis pounding heart. Bit by bit, the darkness gave\nway to a deep red expanse. It was like an\nenormous cave. Eeebs couldn’t see the sky anymore,\nand everything was gloomy. Pillars of\ntwisted stone surrounded him. He’d never seen anything\nlike it. Far away, bright orange streams ﬂowed down\ninto a sea of the same color.\nHe recognized this orange stuﬀ. There was a pool of\nit in the plains not too far from his home. It was very hot,\nlike liquid ﬁre. On cold days, the kittens sometimes\nwent near that pool to warm up. Of course, his mother had\nscolded him for hours after ﬁnding him there.\nThat must be why it’s so warm here, Eeebs thought. He\nturned around, back to the violet screen. He had moved\na great distance by crossing it. Even if he didn’t know\nhow, he was certain of this. So that meant he could head\nback at any time. But those ﬂea scratchers were\nprobably still waiting for him. If he went back through now,\nthey would tear him to shreds.\nNo, he thought. I’ll stay for now. I’m safe here. I only need\nto wait for a while, and …\nJust then, a single wolf emerged from the\nportal. It was very close. Eeebs could smell its rotten\nbreath and the musky scent of its damp fur. At ﬁrst he only\nstared into the wolf’s red eyes, and it stared back.\nNeither of them moved. Total silence. Then its\nconfusion wore oﬀ. Jagged fangs and a low growl\nshook the kitten into action.\nThat action, of course, was bolting across the dark\nred stones.\nHe must be really hungry, Eeebs thought as he jumped\nacross a shallow chasm. Why follow me here? Why couldn’t\nhe have just forgotten about me and gone after a rabbit? He\nzoomed around a column of glowing yellow rock. Rabbits\ntaste better, don’t they?\nEeebs’s path soon came to an end. He skidded to a halt\non a vast ledge. On each side was a dizzying drop. He\nwasn’t afraid of heights, obviously. He was a cat. From\ncountless days of tumbling and tussling in the forest, falling\nfrom the tallest trees, he could survive any drop.\nHe always fell feetﬁrst, but landing on his feet in an\nocean of lava wouldn’t do much good.… And that was all\nhe could see down there.\nA ﬁery orange sea.\nThe wolf scrambled onto the ledge and stopped,\nknowing it had cornered its prey. Eeebs backed\nup against the edge of the abyss. His future seemed\ngrim. Burned? Or eaten? If he died now, though, he\ncouldn’t explore this place. And it had to be\nexplored! To a curious little fuzzball like him, it\nwas the most fascinating place he had ever seen.\nForget the forest. Forget the swamp and the ravine. This\nworld would become their new playground. Still, he\nhad to deal with this tail-chaser, ﬁrst.…\nSuddenly, he remembered something that Tufty had\ntaught him. When chasing prey, a wolf could get pretty\ncareless. The hound surged forward, and Eeebs waited\nfor the right moment. Then he dashed to the side with\nunnatural speed—even for a cat. The wolf’s fangs chomped\ndown on thin air. That was also the only thing supporting\nit now: thin air. The wolf had leapt right oﬀ the\ncliﬀ. It yelped and turned as it fell, disappearing\nover the edge. When Eeebs approached and looked down\ninto the lava far below, there was nothing. Poor wolf, he\nthought. Sadness washed over him. He had only wanted\nto get away.…\nWhich reminded him: How had he moved so fast?\nHe realized he was trembling. His heart was beating\nfuriously, and he was suddenly exhausted. Eeebs\nmoved away from the edge and sank down onto the ground\nwith a sigh. Only an hour ago, he was gathering ﬂowers.\nAnd now …\nWhat rotten luck, he thought. This is the worst day of my\nlife. An icy chill danced up and down his back. And it’s not\nover yet. I still have to ﬁnd my way home.\nThat portal would be easy to spot, of course, but it\nwasn’t in sight. Eeebs had run fast, for a long time, and\nlost his sense of direction. All of a sudden this new world\nseemed much, much larger and much more\nominous. Despite the waves of heat, he couldn’t help\nbut feel a little cold. He curled up into a little ball, pulled\nhis paws in, and wrapped his tail around him.\nWhat should I do? I’m trapped in this gigantic cavern, and\nI have no idea where to go. But … I’m smart. Right? I’ll\nﬁgure something out. Right?\nThe kitten looked around with big, fearful eyes, eyes\nthat shimmered like pools of deep green water.\nWhat will I do now … ?\nWhat will I do now?\nWhile Eeebs trembled in fear, he started to hear\nmysterious noises. They seemed far away. In the\nshadows.\nHe could hear piglike grunts, horrible slithering\nnoises, and something that almost sounded like crying.\nWith each new sound, his eyes grew wider and wider. He\nshrank back against the side of a small cliﬀ, his back\narched.\nWhatever I do, thought Eeebs, I can’t panic anymore. I’ll\nonly get more lost. I have to think back, retrace my steps.\nThat’s my only way out.\nSuddenly, the crying seemed very close. He slowly\nturned his head, afraid of what he might see. That was\nwhen he noticed it: a kind of small white cloud,\nﬂoating in the air. Floating directly toward him.\nNo, it wasn’t a cloud. It had a … face! Whatever it was,\nit looked very sad. It really was crying. A few light\nblue tears were streaming down its cheeks.\nThe ghostlike creature shrieked when it noticed the\nkitten. Eeebs sprang back, tail straight up and fur raised,\nas if electriﬁed. “Leave me alone!” he hissed.\nThe creature paused and gazed down at itself. “Do I really\nlook so terrifying?” The creature sniﬄed. “I must. Even\nthis poor little magma cube can’t stand the sight of a\nmonster like me.”\nIt started crying again—fountains of sparkling blue\ntears, this time.\n“Magma cube?” Eeebs peered cautiously at the\nbizarre creature. “I’m a kitten.”\n“A … kitten?” Its closed eyes shifted with suspicion,\never so slightly. “I don’t think I’ve ever seen a kitten before.\nYou must have come from a nether fortress, yes?”\n“A forest, actually.”\n“I don’t quite understand.” Another sniﬄe.\nNew tears formed in the corners of its eyes. “Oh, that’s why\nI don’t have any friends! I never understand anything\nabout anything!”\nEeebs stepped forward. His curiosity had taken hold. He\nhad so many questions. Besides, it didn’t seem like this\nthing had any intention of eating him.\n“Why are you crying? It’s a little strange, isn’t it? I\nthought ghosts liked to scare people.”\n“Ghost?” The white being ﬂoated down to the kitten’s\nlevel. “I’m a ghast. And I’m not strange!\nEvery ghast is sad about something. Some of us\ncry because there are no ﬂowers here. Others, because it’s\ntoo hot …”\n“Well, why are you sad?”\nThe ghast turned away. “Because I … I have no\nfriends. My whole life, that’s all I’ve ever wanted.”\nThe puzzled kitten ﬁxed his eyes on the ghast. Surely,\nthis was the most interesting creature he had ever\nmet. Why couldn’t he have found that portal sooner?\n“I’ll be your friend,” Eeebs said.\n“What? Oh … I get it. A joke, yes?”\n“Not at all,” Eeebs said. “To be honest, I don’t\nhave any friends either. At least, not here …”\nThe ghast turned back to face him. “Really? You\nmean it?”\n“Of course! Why wouldn’t I? I’ll introduce you to my\nother friends back home, too.”\nThe ghast spun around in midair. “How can this be? Am\nI dreaming?”\n“I doubt it,” said Eeebs, glancing again at this strange new\nworld. “Dreams are never this crazy.”\nThe ghast nodded. He even smiled.\nAlthough neither of them had any idea, this was a\nspecial moment. It was the ﬁrst time in the\nhistory of Minecraftia that a ghast had\nexperienced happiness. Their friendship would be\ndocumented in books and discussed by scholars and\nsages for generations to come.\nThe ghast (whose name was Clyde) ﬂoated near a chunk of\nglowing yellow stone. “This is glowstone,” he said. “It\nlights up areas that don’t have any lava.”\n“Lava,” said Eeebs. “That’s the orange stuﬀ, right?”\n“Correct.”\nFor the past hour or two, the ghast had explained his\nworld to Eeebs. A guided tour of the Nether. The kitten\nabsorbed all of this information, from the zombie pigmen\nto the blazes that soared above their heads.\n“I wonder if I could bring some glowstone back home with\nme,” said Eeebs. “It’s pretty. I think my friend—”\n“Ornk-ornk.” A zombie pigman bumped into\nhim with a grunt. Eeebs gasped and darted behind the\nghast.\n“Don’t worry,” said Clyde. “He won’t hurt you,\nremember?”\n“Right.”\nThe undead pigman stared at the strange companions\nbefore wandering away. Clyde went back to the tour. Of\ncourse, the kitten’s curiosity seemed inﬁnite. Every\ntime the ghast answered one of Eeebs’s questions, the kitten\nasked another.\nWhy is there so much lava?\nWhy are zombie pigmen zombies?\nIs there such a thing as a normal\npigman?\nOnly stuﬀ like that. But those endless questions never\nannoyed Clyde. The kitten could have gone on forever,\nand he wouldn’t have cared. For the ﬁrst time in his life, the\nghast was helping someone. He was making a diﬀerence.\nHe had a real friend.\nAt some point, a chorus of grunts and shouts became\naudible. Far away, across the lava lake, an army of creatures\nhad gathered: zombie pigmen, magma cubes, blazes, wither\nskeletons—even an enderman.\n“Wow!” said Eeebs. “I’ve never seen so many\nmonsters before! What are they doing?”\n“Causing trouble,” said the ghast. “You see that tall\none? The one with the purple eyes?”\nEeebs nodded. “That’s an enderman, right? I’ve seen\none before.”\n“Well, endermen never come here,” said the ghast.\n“Except for him. His name is EnderStar.”\n“So why is he here?”\n“From what I understand, he was exiled from his\nhomeworld. Even the other endermen grew tired of his\ncrazy ideas.”\nThe kitten’s ears perked up. Wow. This is way better than\nplaying hide-and-seek, he thought. An army of monsters! An\nenderman who got kicked out of his own world! What next?\n“Can we get closer?”\nClyde paused. “I’m not so sure that would be such a good\nidea, Eeebs.”\n“Why not? Don’t you want to hear what they’re\ntalking about?”\n“Well, all right. But don’t let them see you, okay? They\nwon’t care about me, but if they notice you . . .”\nEeebs nodded. “How about we hide on that ledge\nover there?”\nWith that, the unlikely duo snuck closer, up a hill that\noverlooked the army. Eeebs peeked out from behind a\nsingle block of netherrack.\nClyde ﬂoated nearby. The monsters below could no\ndoubt see him, but none of them paid any attention. He\nwas a monster, after all.\nBeyond that, everyone was too busy listening to\nEnderStar’s speech. All eyes were focused upon that\nenderman, who stood in the middle of the crowd.\n“We must take back what is rightfully ours!” he\nshouted, before pacing back and forth. He waved a ﬁst\nin the air. “We will crush them all!”\n“Rarg!” A zombie pigman raised his golden sword.\n“Crush dem awl!”\nThe other monsters joined in. The air erupted into an\nangry chant.\n“Crush dem arl!”\n“Crush dem awl!”\n“Crush dem ull!”\nThe monsters fell silent when EnderStar waved a hand.\n“There’s a portal not too far from here,” he rumbled.\n“Our ﬁrst attack will commence from there. This is a\npractice run, nothing more. Once you see how easily\ntheir town crumbles, you will understand the\nspeed with which we can reclaim our world!”\nA huge wither skeleton stepped forward and cut the\nair with his massive sword. “Blah, blah, blah! Talk\nboring! When me get to chop things?”\nAnother zombie pigman raised his head and screamed.\n“Urggrgagrrgr! Me want smash!”\n“Rargragr!” One of the blazes trembled with rage.\n“Gragragagzzzt!”\nEnderStar chuckled—a slow, smoldering sound\nthat echoed across the Nether. “Yes!” he boomed. “That’s\nthe spirit! Follow me, my brothers! Let us show them\nour might! Let them bow before us!”\nA chorus of shouts shattered the air. The army took oﬀ\nat once, slithering and staggering across the dark red\nground. Their cries faded bit by bit.\n“I don’t understand,” said Eeebs. “What’s going on?\nThey’re attacking? Attacking who?”\nClyde looked away. “Well, um …”\n“Tell me!” Eeebs shouted. “I’m your friend, aren’t\nI?”\n“I … I’m afraid they’re on their way to your world.”\nNo, Eeebs thought, blood freezing in his veins. No way.\nWhy would those monsters want to live there? Don’t they\nlike this place? Another frightening question spawned in\na dark area of his mind.\n“Wait,” he said. “He mentioned a portal. Was he talking\nabout the thing I came through?”\n“Most likely,” said Clyde.\n“So, they’re attacking a city nearby?”\n“A human city. Your kind will be safe.”\n“But what if they burn everything?” Eeebs suddenly felt\nweak. His head spun. He stumbled. “I have to get\nback! I have to warn them!”\nClyde sighed. “It’s dangerous, Eeebs. Your mother\nwould want you to be safe. You know that.”\nEeebs leapt forward, his eyes ﬁlled with anger.\n“What if it was your family, huh? Would you just sit\nhere? You want me to …”\nAs his voice trailed oﬀ, Eeebs collapsed. He felt so\nweak, drained, helpless. His limbs were like jelly.\nWhat was happening to him?\nClyde zoomed down. “Hey! Eeebs! What’s wrong?”\n“I … don’t know. It’s like I’m …”\n“Climb onto me,” said the ghast. “I know someone who\nmight be able to help.”\n“I … can’t.”\n“If you want to help your family and friends, you\nwill.”\nEeebs took a deep breath. An image of his mother\nﬂashed through his mind. And Tufty. Meowz. All of them.\nWith the last of his strength, he pushed himself up\nand climbed up onto the ghast.\nSeconds later,\neverything went black.\nShe hovered over a brewing stand, deep in\nconcentration. With one bottle of water and one\nnether wart, she created an Awkward Potion.\nBlub, blub, blub. The potion burbled to life on the stand.\nAfter adding a dollop of magma cream, she made a\nPotion of Fire Resistance.\nOf course, Eldra didn’t stop there. It would take only a\npinch of redstone dust to increase the potion’s\nduration from three minutes to eight. She did just that,\ncarefully measuring the amount. More bubbles and smoke\nthis time—even a little ﬂash of ﬁre. But the extra eﬀort\nwas worth it.\nThat will do nicely, she thought. Now I can go hunting for\nmore blaze powder in the fortress nearby. Those silly blazes\nwon’t lay a spark on me. Afterward, I could even take a lava\nbath. The witch giggled to herself. Just for fun.\nThen she frowned. But I shouldn’t go without at least one\nPotion of Regeneration. Who knows what else I might run\ninto?\nShe opened up her ingredient chest and rummaged\naround. Spider eyes … puﬀerﬁsh … blaze powder … no, this\nwon’t do at all, she thought. Now, where did I put that ghast\ntear?\nSometimes, when a ghast cries, one of its tears will\nharden and crystallize; this is an essential\ningredient to make a Potion of Regeneration.\nUnfortunately, this is a rare event, so such tears are\nhighly prized by witches like Eldra.\nAnd she was totally out.\nBy some fabulous twist of fate, however, the answer to\nher problem arrived right at her iron door.\nClang, clang!\n“Who is it?” the witch called out, still searching through\nher storage container.\n“Me. Who else?”\nOdd, she thought. Clyde sounds less drooping than usual.\nIn her excitement, Eldra whirled around, zoomed over\nto the door, and peered through the window. Sure\nenough, it was him. Was that the hint of a smile on\nhis face? He almost looked … happy. The witch\nblinked, as if she had just seen a ﬂying cow.\nShe hit the button to open the door then stepped\noutside. “You couldn’t have come at a better time,” she\nsaid. “I need to make a—”\n“Listen, I really need your help,” Clyde gushed.\nEldra sighed. “Oh, how many times must we go over this,\nClyde? Let’s stick to our original deal. After you’ve given\nme a thousand of your tears, I will be your\nfriend. You only have eight hundred and eighty-\neight tears to go! See? You’re almost there.”\nWhat the witch had done was indeed a little cruel. The\nghast was so desperate to make a friend that he’d agreed\none year ago to give Eldra one thousand of his\ncrystalized tears. In return, she would oﬃcially be his\nfriend. But not really. Not in her heart. How could she\nbefriend a monster like that?\nOn the other hand, was it really so bad to trick the\nghast like this? It was nicer than killing him. Since\ntheir tears were so valued, ghasts were close to\nbecoming an endangered species. So the witch wasn’t\ncompletely bad. Especially compared to the likes of\nEnderStar.\n“It’s not about that,” said Clyde. “It’s about my\nfriend.”\nEldra burst out laughing. “You?” She giggled again\nat the thought. “Have a friend?”\n“As unbelievable as it may seem, yes. And he’s …\nhurt. Or sick. I don’t know.”\n“Where is he?”\nThe ghast touched down on the ground. “Right here.”\nThe witch approached. She laughed again upon\nseeing the unconscious kitten resting on top of him.\n“I won’t even ask how you two met,” she said. “And what\nexactly is wrong with—”\nShe froze. Her eyes grew wide all of a sudden. “It\ncan’t be! This kitten … has the mark!”\n“Mark? What mark?”\nEldra shook her head. “Oh, you foolish ghast! Why\ndidn’t you bring him to me sooner? Hurry! Give him to me!\nThere’s no time to waste!”\nShe cradled the limp kitten in her arms then dashed\ninside her hut.\nClyde ﬂoated over to the window and watched Eldra set\nthe kitten down on her blue wool mattress. The witch\nperformed a series of gestures over his motionless\nbody.\nThat was when he noticed Eeebs’s size. He had grown\nslightly—his claws, too. His fur now had a blue\nsheen. Was he changing? Why? Was that normal?\nDid kittens really grow so fast?\n“It must have something to do with his illness,” the\nghast sighed. He felt so helpless. He could only ﬂoat by\nthe window while the witch performed her magic.\nEeebs will be okay, he thought. She’ll know what to do. I\ndon’t know what happened to my friend, but she’ll know\nwhat to do.\nEeebs slowly opened his eyes.\nHe was lying on a soft surface. He had slept on something\nlike this a while ago: the farmer’s house. Eeebs liked\nhouses. Real houses, anyway. There were so many\ncomfortable things to sleep on in a real house. Stoves.\nBeds. Carpets. Much better than the hollowed-out log\nthat served as his home.\nNo, he was wrong. How could he think something like\nthat? His home was a real house, too. He remembered\nthe smell of salmon, a smell you’d never ﬁnd in a house like\nthe farmer’s—and suddenly, he thought of his\nmother, of his friends. His home.\nHe had to get back. Had to warn them. Save\nthem.\nEeebs sprang up. He was in a stone hut made of … he\ncouldn’t remember the word. He tried to recall what Clyde\nhad taught him. Netherrock? Netherstone? No, quartz.\nNether quartz. That was it. Where was Clyde,\nanyway?\nJust then, he heard a voice coming from somewhere\noutside. A woman’s voice.\n“Don’t take this the wrong way, but I’m delighted to\nsee you crying again,” the woman said. “What would I\ndo without your tears? Only eight hundred and\neighty-seven left, by the way.”\n“I just hope he’ll be okay.”\nThe kitten’s ears perked up. Clyde?\nEeebs leapt oﬀ the bed and through the window. The ghast\nwas just outside, facing a strange woman he had never\nseen before. Both turned to face him.\n“No way!” said Clyde. “You’re already awake!”\n“Nearly.” Eeebs rubbed his face with his paws. “So …\nwhat happened?”\n“Something extraordinary,” said the witch.\nThe kitten gave her a confused look. “And who are you?”\n“This is Eldra,” said Clyde. “She’s a witch. She’s the\nonly one I could think of who could help you. And she\ndid.”\n“Honestly, I didn’t do much,” she said. “All it took was a\nbit of milk, that’s all.”\n“I don’t understand,” said Eeebs. “Will someone just\ntell me what’s going on?”\nEldra nodded. “You’ve been … chosen.”\n“Chosen? By who?”\n“The Nether.”\nClyde ﬂoated closer. “The Nether found you, Eeebs. It\ncalled you! Your arrival here was no accident.”\nWhat? That just doesn’t make sense, thought the kitten.\nAm I dreaming?\nHe shook his head. “What would this world want from a\nkitten like me?”\n“Purity,” said the witch. “Innocence. Courage.\nLove. You must understand that the Nether isn’t an evil\nplace. It’s ﬁlled with darkness, but it isn’t evil. However,\nmany of its denizens are. The Nether needed a\nchampion, and when it couldn’t ﬁnd one here, well …\nit looked elsewhere. It found you.”\nEeebs staggered. It felt like his body was …\ndiﬀerent. Well, maybe he was just drowsy—still a\nlittle weak. He ignored these thoughts.\n“A champion for what?”\nBut as he asked this, Eeebs realized that this was the one\nquestion he could already answer himself.\n“EnderStar wants to rule the Overworld,” said Clyde.\n“He’s terrible!”\n“And if that happens,” Eldra continued, “the Nether will\nbe in a great deal of trouble. The End, too. You see,\nEnderStar won’t stop until he gains control of all\nthree worlds.”\n“I think I get it.” Eeebs paused. Was he getting\nsmarter? He normally wouldn’t have been able to grasp\nthis kind of stuﬀ. “The Nether wants to stop him before he\ngets too powerful, right?”\nThe witch smiled. “Exactly.”\n“But … even if I want to help,” said Eeebs, “what can I do?\nI’m just a kitten.”\nAs Eeebs said this, Clyde got that look again. It was the\n“I don’t want my friend to freak out, so I’m not going to say\nanything” look.\nEldra wasn’t as considerate. She smirked, looking him up\nand down. “Not anymore.”\nEeebs followed her gaze.\nHis black fur had a vibrant blue sheen. His claws\nwere a bit larger, thick and black. And sharp. He was\nalso bigger and stronger—nearly as big as an adult\nocelot.\nEeebs held out his paws, examining them, moving each\ndigit. They were almost like human hands. “What …\nhappened to me … ?”\n“It’s not like it’s a bad change,” said Clyde defensively. “I\nmean, think of it this way: At least you’ll never have to\nworry about wolves again.”\nThe witch placed a hand upon his shoulder. “The Nether\nchanged you. Strengthened you. And granted\nyou … powers, you could say. Once you learn to\ncontrol them, the minions of EnderStar will fall before\nyou like turnips during a harvest.”\nThe ghast managed a slight grin. “I think ‘nether\nkitten’ has a nice ring to it, don’t you?”\nEeebs stared down in horror. His mind spun and spun.\nIt was just too much for him. What would his mother\nthink? His friends?\nHe would be an outcast.\nHe would become an exile …\njust like EnderStar.\nAgain, Eeebs thought of home. His vision blurred as\ntears ﬁlled his eyes. He wiped them away with a clawed\npaw and nodded at his two friends. “Thank you,\nClyde. Thank you, Eldra.”\nThen, he took oﬀ. The Nether’s dull red terrain\nstreaked past him.\n“Wait!” Clyde called out. “Eeebs! There’s still a lot\nyou need to know!” Eeebs ignored his friend’s cries.\nHe had wasted enough time.\nA crazy nightmare, he thought, leaping over a narrow lava\nstream. A hallucination brought on by too much stress. Or,\nmaybe this is really happening; maybe the Nether really did\nturn me into some kind of weird monster. He tore across\na ruddy stone plain.\nIt must have, because he could sense the portal’s\nlocation across all that twisted stone. He pounced up from\nledge to ledge and raced through every plateau, until the\nglowing violet door was directly in sight.\nHe didn’t know much about the Nether, what it was\ncapable of, or what kind of magic it had placed upon\nhim.\nWas it a curse? A miracle?\nRight now, there was only one thing he knew for sure.\nHe was now a pawn in a deadly game … and he had no\nchoice but to “play.”\nArmed with this sole truth, he cut away his fears and\ndoubts—cut away as if they were just cobwebs in a\nmineshaft.\nJust hold on, he thought, sprinting toward the portal.\nMom … Meowz … Tufty …\nI’m coming!\nThe lava. The inky gloom. The hot netherrack\nunderneath his paws. All of these things the kitten ignored\nas he ran toward the portal.\nHe was too busy trying to make sense of it all. The\nNether: a dark world, a ﬁery world, a world that should\nhave nothing to do with kittens. But for some reason\nthis world chose a kitten to protect it. Perhaps a\nkitten was a better choice than a zombie pigman.\nThen this world called that kitten, pulling him from his\nown world—the bright and tree-ﬁlled Overworld.\nLater, the Nether granted him special abilities to help\nhim ﬁght the hordes of darkness.\nThat kitten’s name was Eeebs.\nAnd Eeebs was trying to escape the Nether.\nThe intense heat no longer gave him any trouble. The\nclouds of smoke, which once made his eyes water, were\nnothing to him. Instead, those eyes were now ﬁxed on the\nwarm light radiating from the portal.\nPortal.\nHis friend Clyde had taught him that word. This portal\nwas a doorway, linking two worlds. It looked like a\nscreen of violet energy, surrounded by a great ring of\nblack stone.\nEeebs couldn’t help but think about Clyde.\nI’m sorry, he thought. Please forgive me, Clyde, for\nrunning away without listening to you. I’ll come back. I have\nto, because I have to thank you. And that witch, too. She\nremoved whatever illness I had.\nEeebs forced himself to stop thinking about his new\nfriends.\nI’m sure they understand.\nEeebs had to go through that portal. He had to leave\nthis world and return to his own. Suddenly, it was the\nonly real thought in his mind.\nNo.\nThere was another thought.\nMonsters, from this world, were headed to his own\nworld. To attack, to destroy. To claim the\nOverworld as their own.\nOf course, Eeebs had to warn his family and friends\nbefore that happened.\nHe slowed down as he neared the portal. Its\nenormous obsidian frame towered before him. All he\nhad to do was step through, as he had before, and he’d be\nback.\nHis heart froze.\nHe feared what he might see upon returning to the\nOverworld. Maybe the monsters had already …\nA frightening image spawned in his mind.…\nNo! There’s no way something like that could happen!\nThose pigmen are too slow!\nHe pushed such thoughts away, but another replaced\nthem.\nEnough, he told himself. I can’t waste any more time.\nHe leapt through the purple mist.\nAs expected, everything went black. He nearly closed\nhis eyes. He was so afraid of seeing something\nhorrible. But the darkness became …\nShades of green, brown. No ﬁre, no ashes.\nNothing was burning. He stepped out of the portal into the\nthicket where the wolves had almost caught him.\nThe trees were still there, along with the grass and the\nﬂowers, and suddenly he realized just how nice the forest\nsmelled. He had never thought about it, until now. Actually,\neven the swamp smelled better than the Nether. That\nplace was horrible for a kitten’s nose.\nThat was when he caught another scent. A familiar\nscent, like rotten mushrooms.\nThat was the stench of a zombie pigman. Yuck.\nHe sniﬀed and sniﬀed, detecting more scents in the air.\nThat ashen smell was from a blaze, and that bitter smell no\ndoubt came from one of those magma cubes.\nThey were … here.\nSomewhere. Somewhere close.\nMaybe just beyond that large hill.\nRelief washed over him. The monsters were stupid and\nslow—they hadn’t yet reached his home. It was far from\nthis area, on the other side of the forest.\nHis mind was working like never before. The monsters\nalso hadn’t reached the village, where the villagers lived. It\nwas even farther away, in the plains past the forest.\nSo since Eeebs was so fast now, he could reach his home\nbefore the monsters.\nOf course, he did want to know what those monsters\nwere up to. Why were they still here, in the forest?\nShouldn’t they have attacked the village by now?\nWhat could they be doing? He hadn’t the slightest idea,\nwhich meant … he had to ﬁnd out. He nodded to\nhimself.\nNo matter how much the Nether had changed him, it\ncouldn’t remove his curiosity.\nWith his nose as a guide, Eeebs began heading in the\ndirection of the monsters. Slowly, at ﬁrst, until soon he was\nbounding over mushrooms and zooming through\ntall grass.\nEeebs climbed up a hill. With every step, the stench\nof monsters grew stronger, and their snarls became\nlouder. When Eeebs ﬁnally reached the top, he crept low\nthrough the grass and peered down the other side.\nHis pulse quickened. There they were.\nAll of them.\nFrom blazes to wither skeletons. A snarling,\ngrowling mass of undead and ﬁery beasts.\nAnd in the middle of them all … EnderStar. The\nkitten’s fear, however, soon evaporated. In fact, he had to\nkeep himself from laughing.\nHe crept closer to get a better view.\nThe monsters, they were … staggering around,\nstumbling into one another. At one point, a zombie\npigman fell over into the grass.\nThen a second pigman tripped over him, went ﬂying,\nand knocked over a third.\nIt was a ridiculous sight: an army of\nfearsome-looking mobs, bumbling around in a\ndaisy ﬁeld.\nTheir distant screams caught his attention. Eeebs\nperked his ears up to catch what they were saying.\n“It hurts!” screamed a zombie pigman. “Mee\neyes!”\nA blaze hissed and sparked. “Massssshter …\nme no see!”\n“Urgggg!!!” A wither skeleton fell over, dropping his\nstone sword. He pointed a bony ﬁnger toward the\nsun. “Yellow square thing! Up there! Too …\nbright!”\nAnother wither skeleton was chopping at a tree.\n“Mee do good, mashter? Look! Mee chop!”\nA zombie pigman joined the skeleton.\n“Mee too, mashter!”\nThe wither skeleton’s sword seemed to be stuck in the\ntree. “BosSsH, mee sword! The enemy is so strong!”\nThe huge enderman let out a long sigh. “That’s\na tree, you idiots!!”\nThe wither skeleton glanced at EnderStar and then back\nat the tree.\n“How can me know, bossh? Mee eyes don’t work right\nnow!”\nThe zombie pigman kept chopping at the tree. “Mee\nwant chop things! So … mee chop!!”\nA great many zombie pigmen writhed on the ground,\nhands covering their eyes as they screamed.\n“Urggh! Mashter!! Make yellow square go away!”\n“It burn! It burn! Rarrrggg!!”\n“Bossh! You say attack village very easy! Holp mee!!”\n“Arggg!! Villagers use magikk on us!”\n“Mashter, mee cannot chop if mee cannot see!”\nThere were lots of shouts like these.\nEeebs only watched in disbelief.\nIt reminded Eeebs of a scary time, when he’d gone\nplaying in a cave. There had been a big spider in there, and\nit had chased him for a long time. The spider had run\nfast, Eeebs remembered. Faster than him. So fast, the\nspider had caught up to Eeebs by the time he exited the\ncave. Eeebs had thought he was a goner. All he could\nhear was that horrible squeak. And then there were\nthose glowing red eyes.\nHowever, when the spider stepped out into the\nsun, it froze. The spider just sat there, right in front\nof Eeebs, fangs dripping and eyes gleaming. It couldn’t\ndo a thing, because it couldn’t see.\nThat was how Eeebs had learned that spiders were\nblinded by sunlight. Spiders lived in caves. Their eyes\nwere used to the darkness.\nWith that in mind, Eeebs now understood why these\nNether mobs couldn’t see. They shared the same\nweakness.\nThe Nether was, in many ways, similar to a cave. When\nhe ﬁrst arrived there, Eeebs assumed it was just one\ngigantic cavern.\nEven though the Nether had areas ﬁlled with lava, it\nwas still pretty dark in most places. So these monsters had\nlived their whole lives in that gloomy place. Their eyes\nwere used to the darkness. Just like the spiders.\nWow, he thought. I never could have understood that so\neasily before. I’m getting smarter, huh? Maybe that’s one of\nthe things the Nether did to me? Made me more intelligent?\nConcealed in the tall grass, Eeebs kept spying.\nEnderStar seemed angrier and angrier.\nThe enderman looked up and shook a ﬁst at the sky.\n“I can’t believe this! All of my planning …\nruined by the stupid sun!!”\nA zombie pigman walked up to the enderman. He was\nwearing a golden object on his head.\n“Mee lord? Maybe we go now … and come back …\nwhen no yellow square thing.”\nEnderStar patted the pigman on the head.\n“You’re a clever one,” he said. “That’s why I’ve\nmade you a captain.”\n“So …” The zombie pigman paused. “We go back\nnow?”\n“Of course.” EnderStar’s voice crackled like lava.\n“Gather the troops. Take them back. This was only\nmeant to be practice, anyway. I wanted you all to get\nsome training before we … attack the real village.…”\nThe pigman nodded. “Yesh, mee lord.”\nEeebs squinted, focusing on the zombie pigman. He\nseemed diﬀerent from the others. He wasn’t\ncompletely stupid, at least.\nSo that pigman was EnderStar’s assistant? Also …\nwhat was that thing on his head? Eeebs continued\nobserving the mobs from his hiding spot. His ears were\nraised up in the direction of the army.\n“Anyway, today was not a total waste,” said\nEnderStar. “We’ve learned something useful. Next time,\nwe’ll come right after the sun sets.”\n“Of coursh, mee lord. So … you go? I take pigmen and\nﬁre things back now? We go home?”\n“Yes,” said the enderman. “See you back at the\nfortress.”\nWith that, EnderStar vanished into thin air.\nPOOF!\nEeebs had encountered endermen before. He knew they\nhad this ability, so he wasn’t too surprised.\nEnderStar also said something about a … fortress.\nFortress.\nClyde had mentioned that word before. He thought\nEeebs had come from a “nether fortress.” So that must\nbe the monsters’ … home?\nEeebs needed to speak with Clyde about this. After he\ntalked to his friends and family, he had to return to the\nNether.\nShaking himself from his thoughts, Eeebs looked at the\nmobs again.\nNow in charge of the other mobs, the smart\npigman turned to his comrades. “Hey! All you! Shut\nup! Stop crying! We go home!”\nLoud grunts and snorts ﬁlled the air.\n“Home better anyway,” said a wither skeleton. “Mee\nno like this place.”\n“Bzzztrg … t-too c-c-cold here,” a blaze sputtered.\n“G-go h-home w-w-warm. Mee happy! Argg! Bzzzt!”\nA magma cube shivered and hopped in agreement.\n“But we no see,” said a wither skeleton. “We no see!\nSo … how we know where go?”\n“I can see,” said the smart zombie pigman. He\npointed to the golden object he wore on his head.\nEeebs had seen humans wearing such things to protect\nthemselves in battle. So did that allow the pigman\ncaptain to see in the sunlight? He really was\nsmarter than most zombie pigmen.\n“Follow me,” he said. “I take you home. All you. Use\nears. Me sing song. Okay?”\n“Thanks, Rarg! Mee so cold!!”\n“Okay! We follow you, Rarg!”\n“Yes!! Lead the way! Get mee out of here!”\nWith that, the captain pigman (whose name was\napparently Rarg) began singing.\n“Ninety-nine villager noobs in da town! Ninety-nine\nvillager noobs! Smash one down! Into da\nground!! Ninety-eight villager noobs in da town! Ninety-\neight villager noobs in da town! Ninety-eight villager noobs\n…”\nAs he bellowed, the captain trudged oﬀ in the direction\nof the portal. The other monsters followed. Some\nbegan singing along:\n“Ninety-seven villager noobs in da town! Ninety-seven\nvillager noobs! Smash one down! Into—” Rarg\nstopped, turned around.\n“Shut up! Only I sing! If others sing, how you know who\nto follow?”\n“Rarg so smart!”\n“Okay! We shut up!”\nRarg turned back around and began singing and marching\nagain. Eeebs watched them go.\nTheir little attack failed, he thought. They must have\narrived very early in the morning, just before sunrise. Then\nthe sun came up and blinded them all.\nAnd they were stranded. Helpless. Helpless underneath\nthat overpowering light.\nThat means … the Overworld still has time. Maybe a lot of\ntime.\nBut … when they do come back, they’ll be more prepared.\nMaybe, when they return, they’ll all have those golden\nthings on their heads, like Rarg.\nEeebs didn’t realize, of course, just how well hidden\nhe was. In fact, as he remained motionless in the grass,\nhe had become nearly invisible. Without another\nthought, the kitten jumped down the hill.\nAfter he moved, he became fully visible again.\nFifteen minutes later …\nEeebs was standing outside of the grove.\nIt was where all of the cats lived. He could hear playful\nmeows in the distance.\nWas that … Tufty? Meowz? He crept through the\ngrass.\nHe couldn’t believe it. He was actually home? And … he\ncould see them now, in the distance.\nHis friends.\nThey were playing some kind of game.\n“Hey, not fair!” hissed Tufty, glaring at Meowz. “You\nalways cheat.”\n“I didn’t cheat,” she said. “You never said no\npeeking.”\n“It’s always like that,” said Tufty. “You never said\nthis. You never said that. I miss Eeebs. At\nleast he played fair.…”\nMeowz looked down at the ground, her eyes full of\ntears. “Me too.”\nEeebs froze. They were still thinking about him. They were\nworried about him. But what would they think when they\nsaw him? His fur was blue now.…\nHe stepped forward anyway.\n“I wonder where he is … if he’s still alive.…” said\nMeowz.\n“If you ask me,” said Tufty, “he went into that thing.”\n“Hmm. Let’s go looking for him again.”\n“Sure, but do you have any idea where that black\nthing is?”\n“It’s called a nether portal,” said Eeebs.\nTufty and Meowz turned to him. The look on their faces\nwas indescribable.\nA piercing sound came from Meowz. “Eeeeeee …”\nTufty stepped back. “Who … is …” Then, the two seemed\nto recognize him. “Eeebs?”\n“Eeebs?” Meowz cautiously stepped forward. “Is that\n… really you?”\nEeebs nodded.\n“What … happened to you?”\n“I’m the one who should ask,” Eeebs said.\n“You went in,” said Tufty. “Didn’t you? You actually …\nwent into that place?”\nThe kittens knew stories of the Nether, although they\ndidn’t call it by that name. Stories about the black door.\nThe glowing purple light. Old stories. Legends telling\nhow the bravest and strongest cats once went\nthrough that door. And never came back.\nEeebs, however, had come back.\nMaybe he had been lucky to meet Clyde, who taught him\nall about that world. Or maybe it wasn’t luck. Eeebs had\nthought nothing of talking to Clyde. But an older, wiser cat\nprobably wouldn’t have tried talking to a ghast. An older,\nwiser cat would have simply run.\nJust as Eeebs had ignored the legends and the warnings\nfrom his mother, he’d also ignored his common\nsense—which generally encouraged running away\nfrom giant white ﬂying things that cried and shot balls\nof ﬁre from their mouths.\nWho knew there could be a ghast who was actually kind?\nThat was why Eeebs had survived.\nAs Tufty and Meowz stood before him, in awe, Eeebs\ntold them about all his adventures. What happened to him.\nHow he changed. How the Nether had chosen him.\n“Chose you for what?” asked Tufty.\n“To help ﬁght against that army,” said Eeebs. “I guess.”\nThen, Eeebs told them about how an enderman was\nplanning to take over their own world.\n“So let me get this straight,” said Meowz. “That place, the\nNether, chose you? To be some kind of warrior? And you\nhave like … special powers and stuﬀ?”\nEeebs nodded again. “Basically, yeah.”\n“Wow,” said Tufty. “That’s too cool, huh? Special\npowers? Fighting bad guys? And honestly, Eeebs,\nyou don’t even look that scary! Where do I sign up? I\nwanna help you!”\n“By the way, what kind of powers do you have, anyway?”\nasked Meowz.\n“Well, I don’t know,” said Eeebs. “I mean, Clyde and his\nfriend were about to tell me more about the change, but\n… I ran oﬀ before they could. I just wanted to ﬁnd you\nguys.”\n“Awww.” Meowz’s eyes grew even more tearful.\n“Thanks.”\n“A good friend,” said Tufty. “Us too. We looked for you\neverywhere, you know? We haven’t really slept since you\ndisappeared. Anyway … I’m just glad you’re back.”\nEeebs sighed. “Me too, but … at some point, I’ll have to go\n… back there.”\nAll three of them looked down at the ground. Then, a\ncry broke the silence.\n“Eeebs?”\nIt was his mother.\nEeebs’s mother carefully approached the three kittens.\nShe looked like Eeebs (the old Eeebs, anyway), only bigger.\nEeebs only swallowed, his eyes wide.\n“Oh boy,” whispered Tufty. “Things are gonna get\ncrazy.”\nMeowz joined him in cowering.\n“This isn’t good,” she murmured. “She scolded Eeebs for\ndays just for going too close to the ﬁre lake, over in the\nplains. How do you think she’ll react to this?”\nHis mother was now quite close, and as she noticed her\nson, she couldn’t hide her astonishment. “Eeebs\nCottonpaw Thistlewhiskers, what on Earth\nhappened to you?!”\n“Mom, I can explain,” said Eeebs, his ears lowered,\ntail between his legs. “You see, there’s this—”\n“Enough!” she hissed. “You’ll explain this to your\nfather!”\nShe picked him up by the scruﬀ of his neck and\nhauled him oﬀ to their cat burrow.\nTufty and Meowz exchanged\nworried glances.\nFor half an hour, Eeebs stared at the ﬂoor as his mother\nscolded him. Of course, he tried telling her about what had\nhappened. But she wasn’t hearing any of it.\n“I told you not to go near that door!” she said. “Cats\nhave no business in there!”\n“I’m okay, Mom. Really. Maybe what happened to me\nis a good thing.”\n“Good?” She turned away. “How can it be good? You\nlook so diﬀerent now. Your fur, it’s … it’s … it’s\nblue!”\nEeebs rubbed up against his mom.\n“Hey. I’m sorry for going in there, but … monsters really\nare going to attack our world.”\n“Well, what can we do about it?” she said. “Let the humans\ndeal with it. And those … villagers.”\n“I don’t think it’s that simple,” Eeebs said. “I mean, the\nmob army is huge. I’ve seen it with my own eyes.”\nThis made his mother even more worried. “And what\nexactly are you supposed to do?”\nEeebs sighed. “I don’t know, Mom. But there must be a\nreason. That’s what Clyde said. He’s a ghast. Oh,\nand his friend, Eldra. She’s a witch. She said—”\n“Ghast?!” his mother yelled. “Witch?! Young man,\nyou won’t go near those things again! Do you\nunderstand?”\n“But they’re my friends.”\n“Friends?! No, you won’t be making friends with\nmonsters!”\n“Not all monsters are bad, Mom.… Clyde is really,\nreally nice.”\nHis mother was really upset now. “Just wait until your\nfather hears about this! You’re lucky he’s out hunting\nright now!”\n“Mom, please just calm down.…”\nIt went on like this for some time. Like most mothers, she\nwas a bit overprotective.\nHis father eventually came back, carrying some\nsalmon. He was a good hunter.\nWhen his father noticed Eeebs, he dropped the salmon on\nto the grass ﬂoor of their house.\n“Son? What … happened?”\nAnd so, Eeebs explained all over again. Thankfully, his\nfather wasn’t as upset. He almost seemed proud of\nEeebs.\n“The Nether chose you?” he said. “I don’t like it, but …\nthis must be important.”\n“What are you saying?” said his mother.\nHis father ﬂicked his tail, thinking for a moment. “I just\nthink we should try to learn more about this.”\n“I can’t believe you’re saying this!” His mom\ncircled back and forth.\n“Honey, we can’t do anything about it. What happened\n… happened.”\nHis mother sighed. Then, there were several cries\noutside.\n“Monster! Run!!”\nEeebs glanced at his mom and dad\nthen dashed outside.\nA crowd of cats and kittens scattered in terror.\nA witch walked out from behind a massive oak tree.\n“Eeebs!” she shouted. “Eeebs! Are you there? Oh,\nthere are so many kittens, but none of them are the one I’m\nlooking for! At least, I don’t think any of you are Eeebs.…\nBlue fur? Purple eyes? No, no, no! Where is he?!”\nThe few remaining kittens squealed and ran oﬀ to their\nparents. But one kitten remained.\nEeebs slowly walked toward the witch.\nThe other felines crouched in their hiding places,\nwatching Eeebs approach what appeared to be a hideous\nmonster. (Actually, to them, Eeebs appeared like a\nmonster as well.)\n“Eldra!” Eeebs said. “How did you get here?!”\n“Same as you. I simply went through the portal,”\nEldra said. “I’m from the Overworld too, you know!”\nSuddenly, Eeebs’s mother and father ran up to him. “Get\naway from that thing, Son! It’s dangerous!”\n“Dangerous?” The witch giggled. “Yes, I suppose I am\ndangerous! But only when I have potions, and I’m all out.”\n“Enough!” said Eeebs’s father. “Leave our son alone!\nHe will not associate with the likes of you!”\nThe witch cackled—an eerie, high-pitched sound. This\ncaused some other kittens in the distance to begin crying.\nAfter the witch stopped laughing, Eeebs sighed.\n“Mom, Dad, meet Eldra. Eldra’s a witch. But she’s\nreally, really nice. She helped me when I got sick.\nI wouldn’t be alive if it weren’t for her. So you should\nthank her.”\nHis parents peered at Eldra.\n“You don’t have to praise me,” said Eldra.\nA bat ﬂew past her. She grabbed it. “Ooooo! How\nlucky! I need bat wings!” The witch stuﬀed the\nsqueaking creature into her belt pouch.\nHis parents backed away, making low growling\nsounds, pulling Eeebs along with them.\nEldra continued. “Actually, your son is special. I’m\ncertain he would have survived, even without my help!”\n“No way,” said Eeebs. “I was so sick. My stomach was\nroiling, and I passed out, and—”\n“Stop it, Eeebs! Just stop!” His mother was\nbeginning to weep again. Then she wiped her face with a\npaw and turned to Eldra. “Is it true? You …helped our\nson?”\nEldra nodded.\n“Who wouldn’t help a lost kitten? Besides, he’s got the\nmark!”\n“Mark? What do you mean?” asked Eeebs’s father.\n“I can tell you what I know,” said Eldra. “But ﬁrst …let the\nrest of your kind know: I wish you no harm. In fact, if you\nwant to survive …you’d best listen to me.”\nAnd so Eeebs’s parents ﬁnally calmed down.\nThe rest of the felines eventually crept back—but\ncautiously, slowly, very slowly.\nAt last Eldra began to tell everyone the history of\nMinecraftia.… How an innocent kitten came to\nbefriend a nice ghast named Clyde … And how an evil\nenderman, exiled from the End, rose to power in the\nNether . . . \nAfter perhaps an hour of talking, Eeebs said his goodbyes to\neveryone he knew. His mother and father were in tears.\n“In case we get attacked,” said his father, “we’ll dig a\nsmall cave nearby. That way we’ll have a place to run and\nhide.”\nEeebs nodded.\n“Good idea. And don’t cry, huh? I’ll be back soon! I\npromise!”\nThen Eeebs turned to his two best friends. Strangely,\nTufty and Meowz didn’t seem upset. In fact, they seemed a\nbit happy.\nAm I just imagining things? Eeebs thought. How can they\nnot be sad? Even I want to cry right now!\n“I wish you didn’t have to go, Eeebs,” said Meowz. “I’ll\nmiss you.”\n“Same here,” said Tufty. “I’m so sad. So sad. But\nhey, you’ve gotta do what you’ve gotta do.”\nEldra the witch smiled at Eeebs’s mother and patted her\nhead.\n“Don’t worry,” Eldra said. “Your son just needs some\ntraining. I’ll do my best. He’ll be back soon. I promise.”\nWith that, Eldra and Eeebs took oﬀ, back to the\nportal.\nFive minutes later, Eeebs already missed his parents.\nAnd his friends. He hadn’t even been home for more than\ntwo hours.\nBut then, his heart grew lighter at the thought of\nseeing Clyde again. Upon entering the Nether, Eldra led\nEeebs back to her stone hut.\n“I’ve been meaning to ask,” said Eeebs. “As you said, you\ncome from the Overworld. So why do you have a\nhouse in the Nether?”\nThe witch sighed. “Well ﬁrst, it’s called a hut.”\nThe kitten looked up at her, waiting for her answer. The\nwitch continued.\n“Brewing,” she said. “Nether wart. Blaze\npowder. The Nether has a lot of things I need. So, I\ndecided to build a second hut here.”\nShe opened the door. “Now, let’s begin.”\nEeebs followed Eldra inside. She walked over to the\ncauldron. The purple liquid bubbling within it smelled\nstrange yet delicious at the same time.\n“Mushroom-bat stew,” she said. “Care for some?”\nEeebs’s stomach grumbled as the witch said this.\nHow sad, Eeebs thought. I didn’t even eat anything while I\nwas at home. I should have grabbed some salmon . . . or a\npuﬀerﬁsh. I’m not picky!\n“Sure,” he said at last.\nThe witch set a steaming bowl of stew on to the ﬂoor. The\nkitten lapped it up hungrily. Actually, it wasn’t that\nbad.\n“Now,” said Eldra. “Before we start, let me tell you: You’re\nnot the only strange creature walking around\nMinecraftia.”\nThe kitten’s ears perked up.\n“You mean there are others like me?”\nEldra shrugged. “In a way.”\n“Like what?”\n“Well, during a full moon, one out of a hundred spiders\nthat spawn are granted special powers similar to yours.\nThe Dark Blessing, it’s called. Some can heal\ntheir wounds quickly. Others are impossible to see or\npossess incredible strength. And then there are\ncreepers, who become much stronger when struck by\nlightning. Pigs struck by lightning turn into zombie\npigmen. And where do you think I came from? I used to be\na villager, you know … until I went out in that\nthunderstorm.…”\nEeebs scratched his chin. “Is all that related to the\nNether, like me?”\n“Not exactly. Still, there are many unusual creatures\nwandering around. So don’t feel alone.”\n“Thank you.”\nEldra smiled. “As for your powers . . .”\n“Yes,” said Eeebs. “You’ve mentioned that before. What are\nthey?”\n“Well, ﬁrst, you’re probably already aware that you can\nthink more clearly.”\nEeebs nodded. “I’ve been able to ﬁgure stuﬀ out on\nmy own way easier than before.”\n“And your senses are sharper, correct?”\nThe kitten nodded again. “I can sense nether portals\nand even see in the dark better than before.”\n“Of course.” The witch gazed into his purple eyes.\n“From what I’ve read, the spider’s Dark Blessing also\naﬀects you, in limited form. If you stand still, you’ll be\nnearly invisible. I’m not sure what you have to do to\nheal faster, though. Beyond that, you’ll ﬁnd that you have\nthe powers of every mob native to the Nether.”\n“What does that mean?” asked Eeebs.\n“For one, you’re all but immune to ﬁre. Including\nlava.”\nLava, Eeebs thought. That’s that ﬁery orange stuﬀ!\n“You mean I won’t be hurt by it?!”\n“Not at all,” said the witch. “You can swim around in it\nall day if you want, and it won’t even singe your whiskers.”\nAt this point, the kitten’s curiosity was overﬂowing. He\ndidn’t have to fear the Nether anymore! He could explore\nas much as he wanted!\nWait, he thought, how can I think about exploring at a time\nlike this?!\n“What else?” he asked.\n“Hmm. You can spit ﬁreballs the same way a ghast\ncan, and I’m guessing you have a Wither eﬀect, like all\nwither skeletons. And a zombie pigman’s strength.\nPerhaps you can even ﬂy like a blaze? But you’ll have to\nlearn how to do all of that from the mobs themselves.\nOf course, I believe you have even more special\npowers, but I must research more. I haven’t had much time,\nsince I had to go looking for you.”\n“This is so great!” said Eeebs.\n“Indeed. When you come to understand your strengths,\nyou’ll basically be a boss monster, like the ender\ndragon or the wither. Cool, huh?”\n“What are those?” Eeebs asked.\n“Oh, never mind.”\nThe kitten sighed. “Whatever. I can’t wait until Clyde\nteaches me how to shoot ﬁreballs. Where is he, anyway?”\nThe witch looked down at the ﬂoor. “Um . . .”\n“What?” The kitten crept forward. “What is it? Where\nis he?”\n“Well, it really hurts to say this, but . . .” The witch\nturned around. “Shortly after you left, Clyde …joined\nEnderStar’s army.”\nEeebs stepped back, slowly. The words repeated in his\nhead, over and over.\nClyde. Joined EnderStar’s army.\nClyde.\nA happy ghast.\nA nice guy. Helpful. Cries at the slightest hint of bad\nnews.\nAnd he joined …those monsters?!\n“I …I don’t get it.… Why?”\n“I don’t know,” said Eldra. “He tried following you, but\nghasts can’t ﬂy very fast, you know. He couldn’t even ﬁnd\nthe portal. I’ve never seen a ghast shed so many tears.\nHe kept asking me where the portal was, how to ﬁnd you.\nI’m not a tour guide! Then he just ﬂoated away.”\nA single tear ran down the kitten’s cheek. “I …can’t . . .\nbelieve this.…”\n“Be strong,” said Eldra. “There must be a good reason\nwhy he did something like that. Believe in your friend.”\nEeebs looked up at Eldra again. “I have to go ﬁnd him!”\n“Of course you do. You should stay here ﬁrst, though,\nand train with me …but you’re not going to do that, are\nyou?”\n“Not a chance,” said Eeebs, shaking his head. “I\nowe him.”\n“Then you’ll want to head to the nether fortress. It’s\nthat way.” She pointed out the window. “You can’t miss it.”\nEeebs glanced out the window, then back at Eldra. The\nwitch gave him a blank look.\n“What? Are you expecting me to ask you to stay here? I\nknow you by now, Eeebs. You’ll go. You’ll do anything to save\nyour friend. There’s simply nothing I can do.”\n“You’re right, just . . .”\n“What?”\n“Do you have any advice for me? It’s not like I’ve ever\nbeen to a nether fortress.”\nEldra took out a book from her item chest.\n“The best piece of advice I can give you is to write in\nthis every day. It’s called a diary. Within its pages, you\ncan record your experiences and any important\ninformation.”\n“But I don’t even know how to write! Or spell. Or read. I’m\na kitten.”\n“Wrong,” Eldra said. “That’s another one of your\nabilities. I forgot to mention that.”\n“But even if I know how to write, I can’t hold a quill!”\nEldra handed the kitten a quill. “Haven’t you noticed your\npaws are a little diﬀerent?”\nEeebs glanced down at his paws, held each one in front of\nhim, and then grabbed the quill.\n“Unbelievable.”\n“What’s so hard to believe?” asked Eldra. “This is\nMinecraftia.”\n“Right. So …book, quill, anything else?”\n“You’re smart. You’ll ﬁgure out the rest. And do bring\nClyde back. He owes me more tears.”\n“Count on it.”\nOnce again, Eeebs took oﬀ without much hesitation.\nHe had an inventory, a diary, a quill, and a whole lot\nof courage.\nBut how am I going to sneak into a nether fortress? he\nthought. What’s Clyde doing, anyway?\nWhy did he join that crazy army? Was he angry because I\ntook oﬀ? What happened?\nEldra watched the kitten zoom oﬀ into the Nether.\n“He’s sure got spirit,” she said to herself. “I think he’ll\nbe just ﬁne.”\nShe went back into her hut, glanced at the bubbling\ncauldron, at the brewing stand, and ﬁnally …her mat on the\nﬂoor. It was just carpet, but it was the best she could do.\nBeds exploded in the Nether, for whatever reason.\nShe suddenly felt exhausted. She yawned, headed\nover to her mat, and …heard a mewing sound coming\nfrom just outside her hut.\nWhat’s that noise? she thought. It almost sounds like a\nkitten! But . . . what’s Eeebs doing back so soon?\nThe witch, thoroughly confused, went outside and\nglanced around. Lying nearby, on the reddish netherrack,\nwas not just one kitten, but two.\nThey looked sickly, barely conscious, as Eeebs had been\nafter he’d ﬁrst entered the Nether.\nHowever, they didn’t look like Eeebs at all. One had tan\nfur with orange stripes. The other, light gray and\nbrown with bright blue eyes.\nBoth kittens soon stopped moving, having lost\nconsciousness.\nEldra carefully approached them. She realized she\nwouldn’t be getting sleep anytime soon. She needed two\nbuckets of milk to cure their illness, and she was fresh\nout.\nI wonder, she thought. Can I bring a cow into the Nether?\nShe bent down and picked up the two kittens, one in each\narm, then took them into her hut and laid them on her mat.\nOf course, she wasn’t surprised when she examined\nthem.\nLike Eeebs,\nboth kittens had the mark.\nMeow?\nOkay. There we go. I ﬁnally ﬁgured it out.\nApparently, I needed to use \na chicken feather, not my paws.\nSo, where do I begin? My name is Eeebs. I’m a kitten.\nWell, sort of. I’m a little diﬀerent, nowadays.\nWhat happened? I still don’t know completely. I was just\ntrying to get away from those wolves. Then I found that\nnether portal.…\nAfter I stepped through, I began changing. I found\nthat I could run faster, jump higher. Even turn slightly\ninvisible. This witch I met said I could even gain the\nabilities of monsters.\nPlus, I’m way smarter than I used to be. After all,\nkittens don’t typically have diaries.\nThe witch said there’s a reason why all of this happened.\nI’ve been “chosen” to help save the world. There’s this\nhuge army of monsters, and they want to take over all\nthree dimensions.\nOf course, I’m supposed to help stop them. Me. A\nkitten. I ﬁnd that hard to believe.\nThe only thing I’ve ever been good at is chasing\nbats around. I’m pretty sure there’s a lot more to\nsaving the world than that.\nAnyway, for now I’m putting all that aside. You see, during\nmy time in the Nether, I also made a friend: Clyde.\nHe’s a ghast. He taught me a lot of things about his\nworld. But then, the witch said he took oﬀ to join that\narmy.\nMy best buddy, siding with the enemy? Clyde would\nnever do that! And if he did, it must have been for a very\ngood reason. Maybe he’s spying on them. Or maybe they\nforced him.\nIn the end, it doesn’t matter why he left. I have to go\nﬁnd him.\nThe witch said that Clyde took oﬀ to this place called a\nnether forest. Was she joking around with me? I don’t\nthink the Nether even has forests.\nI’ve been searching for hours\nand haven’t found a single tree.\nI searched around the Nether some more.\nAt ﬁrst, all I found were mushrooms, glowstone, and\na lot of zombie pigmen.\nThen I saw a weird creature. He was stranded in\nthe middle of a lava lake, balancing on a single block of\nnetherrack.\nThe Nether is full of strange stuﬀ, but I’ve never\nseen anything like it before. I just had to see what he was\ndoing there.\nBut as I got closer, I noticed that this creature looked\nunfriendly. Dangerous, even. He was made of\nbones and was carrying one of those sharp things the\npigmen always have on them.\nJust as I turned away, he shouted:\n“Hey! Don’t leave, huh?! I really need some help over\nhere!”\nMy curiosity got the best of me. I turned back and\napproached the lava.\n“How can I help?” I called out, stepping to the lake’s\nedge. “I can’t swim in lava.”\n“Sure you can,” he said. “You won’t burn up! Just\nhop in, ﬂoat over here, and give me a ride! Wait …you\nare a magma cube, aren’t you?”\n“Actually, I’m not.”\nThe creature leaned forward slightly, as if taking a better\nlook. “Oh, sorry! My vision’s not the best these days.\nWell, if you’re not a magma cube, what are you, then?”\nHis question totally threw me oﬀ guard.\nHow could someone not know a kitten when they see\none? Even one such as myself …\n“What do you mean, what am I?!” I hissed. “What\nare you?!”\nThe bony ﬁgure whirled around, apparently just as\nshocked. “What? Haven’t you ever seen a wither\nskeleton before?!”\n“I have,” I said. “But only a few times, and I never knew\nwhat you guys were called. I’m from the Overworld.\nLong story.”\n“Right. Some other time.” The so-called skeleton\npaused. “Got a name?”\n“Eeebs. You?”\n“Batwing.” He glanced around. “Well, Eeebs from the\nOverworld, how about we help each other out?”\n“Assuming I even could get you out of there,” I said,\n“what would you do for me?”\nThe skeleton laughed. “Simple. You need a guide.\nYou’re clearly lost. I mean, if you knew anything\nabout this place, you wouldn’t be going that way. No,\nanywhere but that way.”\nI glanced in the direction I’d been heading earlier.\nAll I could see were netherrack hills, nether quartz veins,\nand lavafalls.\n“It doesn’t look so bad,” I said, pretending not to\ncare. But again, my curiosity soon took hold. “What’s over\nthere, anyway?”\n“More of my kind,” Batwing said, “plus a whole\nlot of blazes. And none of them are as nice as me. Believe\nme, fuzz block, the last place you want to be going\nto is a nether fortress.”\nMy ears perked up. Nether fortress …?\nSo that explained why I never found any trees. I thought\nthe witch had said nether forest, but I must have\nmisheard.\nThis whole language thing is still new to me. I could\nspeak with other cats before, yes, but my conversations\nwith other creatures were …very limited. The only non-\ncat word I knew before this change was “grr,” which is\nwolf for “I’m going to eat you now.”\nAfter realizing what the skeleton had said, I was so\nexcited that I stepped to the very edge of the lake and\nnearly slipped oﬀ.\n“A nether fortress?! That’s exactly where I need to\ngo! My friend went there! I need to save him!”\n“You’ve got to be kidding me.…” The wither skeleton\nlowered his head. “And here I thought it was my lucky\nday.…”\n“The deal’s still on, right?”\nThe skeleton shook his head. “No. No deal. No\nway am I going there.”\n“Fine.” I turned around. “Then I’ll just have to go there\nmyself. See you around!”\n“N-no, w-wait!” the skeleton called out. “Okay! You\nwin! Just get me oﬀ this rock, and I’ll take you anywhere\nyou want to go.”\nI nodded. “What do I do?”\n“That’s easy. Since you can’t swim, you’re going to\nbe building a bridge.”\nBridge? Another word I didn’t know. Clyde had taught\nme a lot of words, but he’d never mentioned anything\nabout bridges.\n“A what?”\n“Seriously? They don’t have bridges in the\nOverworld, either?”\n“Maybe they do, but I’ve never heard of them. Also, what’s\n‘building’?”\nBatwing grumbled to himself. “Never mind. I’ll walk\nyou through it. You don’t happen to have any tools, do you?”\nMy confusion only grew. “Tools?”\nMore grumbling from my new friend. He glanced\ndownward, particularly at my paws. Then he chuckled.\n“Y’know, actually, I think we can make this\nwork.”\n“Come on! Punch!”\nA skeleton named Batwing, surrounded by lava,\nshouted these words at me. It’s been a weird couple of days.\nStill near the shore, I stared down at the reddish\nnetherrack beneath my paws. “So, I just hit it? Like\nthis?”\n“Exactly! But harder!”\nI threw a real punch this time.\nCracks formed where my paw struck the ground. Only,\nthey vanished as quickly as they had appeared.\n“Don’t stop!” Batwing called out. “Just keep\npunching!”\n“Seems a little weird.”\n“It’s not! It’s what you have to do when you don’t have\nany tools!”\n“Right.” More punching.\nMy paws hammered away at a block of netherrack.\nI didn’t let up this time—just kept punching away. The\ncracks grew larger and larger, until ﬁnally the block\ncame loose. I pulled it out without too much eﬀort.\nIt wasn’t as heavy as I’d expected.\nBatwing seemed pleased. “That’s it! Now, just\nplace it over by the edge there!”\nI did as he instructed. Since I was holding the block\nwith my front paws, I had to stand upward on my hind legs.\nI was walking. Just like a zombie pigman. Only\nnot as fast. Hobbling over, I shoved the block against the\nedge of the shore. Strangely, as if by magic, the block\nsnapped into place.\nI’d never known that it was possible to change the\nenvironment like this. Truly, I understood nothing about the\nrules of this world. (Even if I am smarter than the\naverage kitten, I still have a lot to learn.)\n“Great work so far!” Batwing said. “Now, do it ﬁve\nmore times!”\nI glanced at the lava between us. Suddenly, it all made\nsense.\nIf I placed enough blocks, a row of netherrack would be\nformed across the lava, a so-called “bridge.” (Gosh,\nthese monsters and their fancy words!)\nPunch, punch.\nI moved a second block. A third.\nFinally, after I placed the sixth, Batwing jumped so\nhigh it was almost as if he could have cleared the lava\nwithout a bridge at all.\nThen he zoomed to safety, stopped, spun around, and\njumped again. “Oh, man! I can’t believe this! You\ndon’t know how thankful I am, kitten! I was trapped\nthere for weeks!”\n“Now that you mention it,” I said, walking up to him,\n“exactly how did you wind up there?”\nBatwing looked away. “Those animals! They put\nme there! After I told them we shouldn’t be attacking the\nOverworld!”\n“Who’s ‘they’?”\nThen it hit me. “You mean you were part of that army?”\n“Yes. Was. I couldn’t go along with everything they\nwere doing. That enderman is crazy.”\nI knew he must have been talking about EnderStar—an\nenderman so bad his own kind actually kicked him\nout of the End.\n“By the way,” Batwing went on, “you should know that\nnot everyone in the Nether is bad. Like my friends. I’d\nlike to introduce you to them.”\n“That’s ﬁne,” I said. “But ﬁrst . . .”\n“Yeah, yeah, I know. We’ll ﬁnd your friend. But let’s\nget one thing straight ﬁrst.”\n“What’s that?”\n“I’ll do all the talking.”\nWe ﬁnally reached the fortress.\nI’d never seen anything so big—just block after\nblock of nether brick.\nAnother so-called “bridge” spanned a wide chasm ﬁlled\nwith more orange ﬁre water. A wither skeleton was\nstanding guard there.\n“That’s Wishbone,” Batwing whispered. “Not too smart,\nbut an all right kind of guy. Just follow me and don’t say\nanything. Actually, wait. Make a hissing sound. Can you\ndo that?”\nI hissed. “Like this?”\n“Kind of. But more like smoldering magma or\nsomething.”\n“Magma?”\nBatwing facepalmed. “Dude. You have seen a\nmagma cube before, right?”\n“Maybe? I don’t know?”\n“Whatever. After we go up to him, just start\nhissing.”\n“Okay.”\nBatwing walked up to the wither skeleton, and I followed.\n“I never thought you’d make it oﬀ that block,”\nWishbone said, “with your fear of swimming and all.\nAnyway, the boss said you aren’t exactly welcome here\nanymore.”\n“That’s ﬁne.” Batwing pointed at me. “I just wanted to\nshow the boss this, and then I’ll be on my way.”\n“Huh? What’s that?”\n“A very rare type of magma cube,” Batwing said.\n“Might be useful for the army.”\nWishbone approached me. “Doesn’t look like any magma\ncube I’ve ever seen. Aren’t they supposed to look like, um,\nyou know, magma?”\nBatwing shook his head. “As I said, this is an\nextremely rare type. And very powerful, I\nmight add.” He glanced at me. “Plus, it hisses, just like\nany magma cube.”\nOh. Right.\nI hissed as loud as I could.\n“What kind of sound is that?!” Wishbone said. “Listen, it\ndoesn’t sound like a magma cube at all, and why is it\nblue?”\nBatwing sighed. “You’re making fun of a poor little\nmagma cube because he’s blue, are you? You know the\nboss doesn’t like such discrimination!”\n“N-no,” Wishbone said. “I—”\nBatwing shook his ﬁst, seemingly angry. “So he’s blue!\nSo what?! Do you know how many monsters have made\nfun of him for this?”\n“I was just joking!”\n“Clearly! A joke at his expense!”\n“I’m sorry! Please come in! Don’t tell anyone I said\nthat!”\n“Fine. And don’t tell anyone we’re here,” Batwing said. “I\nwant EnderStar to be surprised when he sees his new\ngift.”\n“Y-yeah, okay, okay.” Wishbone looked at me. “Sorry,\nman. Blue magma cubes are totally cool, all right? Even\nblue magma cubes with legs!”\n“Hissss?! Hisss! Hiss-hiss-hiss!!”\n“I said I’m sorry!” He stepped backward and made a wide\ngesture. “Come on in.”\nWith that, we walked past him and stepped inside the\nfortress.\n“You’re probably wondering why that guy was so\nafraid,” Batwing said once we were out of earshot. “From\nwhat I’ve heard, EnderStar was picked on as a kid because\nhis eyes glowed too brightly.”\n“I certainly know how it feels,” I said. “So, any monster\nunder his command who makes fun of another’s\nappearance is punished?”\n“Yeah. Something like that.”\nAs we wandered farther inside, I began to realize just how\nhuge the nether fortress was: Endless halls stretched for\nhundreds of blocks.\nThere were so many monsters here, too. I’d seen\nmost of them before. Batwing told me the angry ﬁre\nthings, ﬂoating in the air, were called blazes. More wither\nskeletons marched in groups, along with zombie\npigmen. I even saw a few ghasts ﬂoating around in the\nlarger chambers. Sadly, none of them were Clyde.\nAnother wither skeleton soon stopped and questioned\nme:\n“Hey! You there! What are you, exactly? You’re the\nstrangest-looking monster I’ve ever seen!”\n“I am Lord Sizzleblock,” I said, “Royal Magma Cube\nfrom the Overworld. EnderStar has asked me to pay him a\nvisit. And you are?”\n“Yes, let us know your name,” Batwing said, “so that\nthe noble Lord Sizzleblock can inform the great\nand powerful EnderStar of such discrimination and\n—”\nThe skeleton fell to his knees and bowed so deeply he all\nbut kissed the nether brick ﬂoor. “Forgive me at once, Your\nMajesty! I simply didn’t know that your kind came in\nsuch lovely shades of blue! How many times do you want\nme to bow?”\n“Fifty should be enough,” I said.\n“Of course, my lord!”\nEvery time a monster questioned us, it went pretty\nmuch like that.\nOnce, a zombie pigman grunted at us. “Urg! Who you?\nWhy you here?” He looked closer. “Urguu?! What you\nare?!”\nBatwing pointed his sharp stick at the zombiﬁed\npigman. “How dare you address the grand and\nmajestic King Flamepixel with such insolence! He\nvisits upon EnderStar’s request, who shall be notiﬁed of\nyour—”\nThe zombie pigman didn’t apologize.\nInstead, he ran oﬀ the nearby edge of the fortress—\nwithout jumping, just kind of tipping over—and fell\ninto the lava far below. The way he dropped oﬀ instead of\njumping …it was like he wanted to reach the lava as fast\nas zombie pigman–ly possible, to the millisecond.\n“Wow,” I said. “Um …that was a pretty extreme\nreaction, no? They must really fear EnderStar.”\nSeconds later, a blaze appeared. “Gzzzzt?! Www-w-\nwhat?! Bgzzzt!! A-a-are?! Gzrrg!! Y-y-ou …?!”\nI stepped forward, about to say something. I didn’t\nneed to, though. Not this time. The blaze was very\nconfused by the sight of me. So bewildered, in fact,\nthat it began trembling in the air, made a weird\nsputtering noise, and ﬂew oﬀ while spinning around and\ngurgling—its direction and angle changing randomly as\nit did.\nI watched the blaze disappear into the gloom\noverhead. “Do I really look that weird?” The sputtering\nsound eventually faded completely.\nThen I heard a voice in the distance.\n“Eeebs?!”\nThere he was, gliding through the air.\n“Clyde! What are you doing here?! I’ve been\nlooking everywhere for you!”\n“Oh, Eeebs. I’m so sorry. I . . .”\n“Did you really join their army?”\n“Yes,” he said. “But I only joined because I was looking for\nyou, too! I didn’t know how to go to the Overworld and\nwas too scared to go there alone.”\nI felt so relieved. Of course. I knew Clyde wouldn’t\nactually join them.\n“We have to get out of here,” I said. “Everyone keeps\nfreaking out when they see me.”\nClyde nodded. “I’ll say! A blaze just ﬂew past me,\nupside down!”\nWe heard a faint boom oﬀ in the distance, as though the\nblaze had crashed into a wall and exploded.\nBatwing winced. “Poor guy. Anyway, let’s get out of\nhere. More monsters will show up any minute.”\n“He’s right,” Clyde said. “Let’s go.”\nLong story short, I ﬁnally caught up with Clyde again.\nWe made it out of the nether fortress without much\ntrouble.\n“The Overworld is in danger,” Clyde said, once we\nwere in the clear. “EnderStar is gearing up for something\nbig. Much bigger than we thought. Not even the\nNether will be safe.”\n“About that,” Batwing said. “You two seem like cool mobs.\nI’d like to introduce you to my friends.”\n“Fine by me,” I said. “As long as they won’t do\nsomething crazy upon seeing me like turn into a baby\nslime.”\nI didn’t know it then, but Batwing was about to show us\nwhat I now consider to be the coolest place in the\nNether.\nDuring our trip to see Batwing’s friends, the wither skeleton\ndid something strange. He retrieved a purple rock\nfrom somewhere I couldn’t see.\n“That’s a strange-looking rock,” I said.\n“It’s not a rock. It’s a crystal. And it’s called a\ntellstone.”\n“What does it do?”\n“It can be used to send messages to other people.\nEven people who are far away. Even people you don’t\nreally know. You can speak with them in their\ndreams.”\n“How is that possible?”\n“I don’t know. Magic. Anyway, it isn’t working properly. I\nwas only able to contact two villagers.”\n“Can we speak to them now?” I asked.\n“Hmm …maybe. Let’s try.”\nBatwing held the crystal closer so that I could see.\n“Nah. Maybe they’re not sleeping right now.… Oh, wait!\nGuess they are.”\nThe face of a villager boy appeared in the crystal. It\nwas the strangest thing I’d ever seen.\nThe villager’s voice seemed to resound from within the\ntellstone:\n“As if my dreams aren’t bad enough. Now I get to listen\nto this bonehead talk in that scratchy, gravelly\nvoice of his.”\nBatwing moved the crystal closer and began speaking into\nit.\n“Bonehead? I’m not the one who just bombed three\ntests! Hey, I’m sorry, all right? Hey! Don’t shut me out,\nkid! Look, I’m not going to ask you to save me! Someone\nelse already did!”\nThen the wither skeleton extended his arm to move the\ncrystal farther away from us.\nWhen he did, the villager boy seemed shocked. It was\nlike he really could see me somehow.\n“Don’t look at them like that!” Batwing said, speaking\ninto the crystal once more. “They’re not monsters! Well,\nokay, they are monsters, and so am I, but we’re\ngood! We’re not like the rest! We’ve made a whole\ncity by ourselves! A city of good monsters, hidden from all\nthe bad ones! By the way, this is Eeebs. He won’t\nbite. Promise! Oh, and that’s Clyde over there. Both\nof them are really nice!”\nHe said a lot more to the villager (advice of some kind),\nbut I’ve already forgotten it.\nAfter walking across countless hills and following Batwing\nthrough an enormous cave, I ﬁnally saw it:\nLavacrest.\nThe city of good monsters, hidden deep within a\nnetherrack mountain.\nVast streets of nether brick stretched endlessly.\nBlocks of glowstone sat upon posts of nether-brick fence.\nCountless iron doors led to shops, homes, and even\nschools where monsters could study various crafts,\nlike mining and enchanting.\nEvery monster imaginable could be seen here, even\nsome not native to this dimension, such as\nendermen and witches. They had traveled here to learn\nmore about magic. Magic …that was something I was\ntotally unaware of, until today.\nWitches, huddled in groups outside, were uttering\nstrange words. White glyphs hovered in the air before\nthem.\n“What are they doing?” I asked.\n“Casting a protective spell,” Batwing said. “I forgot the\nname.”\n“Reinforce,” Clyde said. “They’re enchanting the\ncity’s blocks to be more resistant to explosions.”\n“There’s even a spell that can make a block impossible\nto mine,” Batwing said. “It’s pretty high-level, though,\nand consumes a diamond upon casting.”\nAs we wandered the streets, with me staring in awe,\nClyde and Batwing went on about the many block\nenchantment spells. One spell, Spike Growth,\ncaused a block to grow spikes on each of its sides,\ndamaging anyone touching it or walking across its surface\n—much like cactus. First Burst acted like a trap:\nAnyone stepping on it caught ﬁre. There was also a\nlightning-based version, known simply as Zap. Another,\nFrost Aura, provided a slowing eﬀect.\n“Kind of like soul sand,” Clyde said. “Except it also\nmakes you attack slower.”\n“Soul sand?”\nBatwing sighed. “That sand you saw in the nether\nfortress.”\nIn addition to block enchantment spells there were spells\nthat created new types of blocks, such as Shadow\nBlock. After casting this spell, you chose a material—\nsand, cobblestone, netherrack, anything—and a block of\nthat type would appear. This block, although appearing\nreal in every way, was something called an “illusion.”\nYou could walk through it as easily as walking through\nair.\n“We’re about to place these blocks across the cave\nentrance leading to this city,” Batwing said. “That way,\nEnderStar’s soldiers will never ﬁnd this place.”\n“Don’t you need a bat’s wing to cast that one?” Clyde\nasked.\nBatwing nodded. “Yeah. We really need to head to the\nOverworld and go bat hunting.”\nAnother spell was called “Light Block.” It created a\nblock of intense white light, which could be walked\nthrough. However, standing within such a block was like\nstanding in sunlight.\nA more powerful version of the spell, Concentrated\nLight Block, was twice the normal strength of\nsunlight, meaning it would burn monsters to a crisp.\n“We ﬁgure a wall of light blocks might be useful against\na zombie horde,” Batwing said. “Sadly, both versions of\nLight Block require emeralds to cast.”\nAnd then there was Mud Aspect, which gave a\nblock mud-like consistency. Anyone stepping into it\nwould slowly sink down. Their movement speed would be\ndecreased as well, although not as much as the eﬀect\nFrost Aura provided.\nNeedless to say, Slime Aspect gave any block the\nproperties of slime, meaning it could be used to bounce\nupward.\nBut the most interesting, in my opinion, was\nTeleporter Cube. I didn’t understand how it\nworked, but Clyde said it could be used to travel vast\ndistances instantaneously.\n“Not a single monster in the city knows that spell,”\nBatwing said. “Not even Greyfellow.”\nI blinked. “Greyfellow?”\nFor once, Batwing wasn’t annoyed at my cluelessness.\n“He’s the guy who runs this place.”\n“He’s also the guy we’re going to see,” Clyde added.\n“I’m sure he must know more about your …current\nstate.”\nPerhaps ten minutes later, we reached Greyfellow’s\nhome: a huge hut made of nether quartz. Batwing\nincreased his pace, muttering something to himself.\nClyde and I exchanged glances\nand followed him in.\nGreyfellow was an enderman.\nHe wasn’t black, however, but light gray in color with\nbright sky-blue eyes. In addition, he wore a fancy-looking\nwhite hat, not unlike those typically worn by witches. He’s\nknown as an “endermage,” one of the last\nenderman wizards in all of Minecraftia.\n“Where have you been?” he said to Batwing.\n“Yeah, about that,” Batwing said. “Those bums stranded\nme out there.”\n“Oh?”\nBatwing withdrew the brilliant purple tellstone\nfrom his inventory. “And your little crystal didn’t work.”\n“What do you mean it didn’t work?”\n“Well, I tried telling those villagers that the Overworld\nis in danger. I begged them to set me free. The girl\njust ignored me, and this little punk, Runt,\nkept telling me to go away.”\n“My apologies,” Greyfellow said. “Villagers are a crude\nfolk. They can sometimes be …uncouth. Interesting that\nyou weren’t able to contact anyone else, though. Hmm …\nGive me the tellstone.”\n“Gladly. Take it.”\n“I shall craft you a new one later tonight,” the\nendermage said. He glanced at Clyde and me. “And who are\nyour new friends?”\nBatwing introduced us, and the endermage noticed my\nmark. “Interesting. You come from the Overworld,\nthen? Yes. You were once a kitten. I can see that now.”\n“Do you know what happened to me?” I asked.\n“I believe so. Although, I must consult the ancient\ntexts. Go now. Eat. Sleep. In the morning, we shall\nspeak again.”\nBefore long, I’d eaten three cooked salmon\nand was curled up next to a burning block of netherrack.\nHow these monsters got ahold of salmon, I didn’t know\nand didn’t ask.\nMagic, probably.\nYawn. Maybe they can conjure food as well as blocks?\nAs I dozed oﬀ,\nI started purring.\nThat morning, I met up with the gray enderman again.\nHe told me a lot of stuﬀ and showed me this huge,\nancient book.\nHe let me borrow it, so I’m going to copy some of it\ndown.\n***\nTHE PROPHECY OF MINECRAFTIA,\nVOLUME I\nAnd so shall it be: In these perilous times, two\nSaviors shall descend from the Sacred Light and\ndrive the Veil of Darkness to each corner of the\nworld.\nOne Savior shall take the form of a young Human\nman—KOLB. He represents all that is Earthly and\nKnown. The other shall arrive in the form of a young\nSylph woman of most enchanting beauty—IONE.\nShe represents the Unearthly, the Unknown.\nAlas, our Saviors walk a diﬃcult path, for their\nDivine Weapons, forged by the White Shepherd and\nblessed with Sacred Light, were all but destroyed\nduring the Second War. Only when their shards have\nbeen reunited can each Weapon be fully re-forged.\nIn addition to our Saviors, ﬁve Beings shall be\nChosen by the Light:\n1. A villager displaying incredible creativity and\ninsight, with compassion for all life. He shall\ntake up the sword and become not only a\nWarrior but a supreme Tactician without equal.\nAlthough his power comes from within, the\nSacred Light shall assist him in the form of\nLuck. He is a champion of the Overworld.\n2. Three animals displaying the highest bravery in\nthe face of great danger and loyalty to their\nfriends. The gender and form of each animal are\nUnknown. They shall be blessed with higher\nintelligence and begin to take on the aspects of\nmonsters. The ﬁrst of these Chosen Animals\nshall seek to meet and serve the ﬁrst Chosen\nBeing. These animals are champions of the\nNether.\n3. The third Chosen Being is entirely Unknown,\nalthough it is Known that this Being shall be\nmost bizarre in nature. He serves as a\nchampion of the End.\nKnow this: As the Darkness continues to spread\nacross our World, our Saviors must seek to reclaim\nthe fragments of their Divine Weapons, for these\nblades are the only two Divine Weapons remaining\nafter the Second War. The rest, destroyed by the\nEyeless One, are lost for eternity.\nBefore all else, our Saviors shall head to the\nCapital of our World, known as Aetheria City,\nwhere they shall learn of past knowledge and train\nthemselves, for their energy will have diminished\nduring their journey.\nSoon thereafter, the Great War shall begin between\nthe forces of Light and Darkness.\n***\nOkay. There’s much more to that book, but my head\nhurts. (My paw, too.)\nIn dark times, heroes from “another world” will arrive\nto ﬁght against evil. Five beings from this world have been\nselected as well.\nI’m one of the animals mentioned. I’m supposed\nto ﬁnd and serve the ﬁrst “Chosen Being.” A villager.\nThat means I need to return to the Overworld.\nBut that enderman wizard, Greyfellow, doesn’t want me\nto. Not yet. He says I must learn more about my abilities\nbefore I leave. I must become stronger.\nWe talked about this stuﬀ all day. I’m really tired, now.\nTalking in a non-cat language I’ve just learned is still\ndiﬃcult for me, remember?\nBy the way, some of the monsters here really can\nconjure food with magic. It’s so cool. All I have to\ndo is ask some witch or enderman for raw salmon. I can\ncook it myself because I’ve been blessed with higher\nintelligence, according to that old book. How cool is\nthat?! Meow!\nTime for sleep.\nMy “training” starts tomorrow.\n“They’ve found us! They’ve found us!”\nI woke up to a creeper wizard shouting these words. I\nwas still at Greyfellow’s house. When I walked outside, I\nsaw so many diﬀerent monsters running around and\nshouting.\nFrom this crowd, Greyfellow and Batwing emerged. They\nwere holding on to a zombie pigman by each arm. He\nseemed familiar somehow. But where could I have seen\nhim before?\n“We found him sneaking around just outside the city!”\nBatwing said. “Little snoop!”\nClyde ﬂoated down to our level. “What are we going to do\nwith him?”\n“We’ll have to imprison him,” Greyfellow said. “If we let\nhim go, he’ll give EnderStar the location of our city.”\n“N-no,” the pigman said. “Me. Want. T-to—”\n“Shut it!” Batwing said. “You’ll say anything to get\naway!”\nA creeper shouted: “Hisssss, me blow him up!”\n“I say we throw him into the pit!” a nearby witch\nshouted. “That’s the best way!”\n“Yesh! Duh pit! Duh pit!” After uttering these noises,\nseveral zombie pigmen (good ones, apparently?) began\nchanting: “Duh pit! Duh pit! Duh pit!”\nSoon, hundreds of monsters joined in.\n(However, most were shouting/chanting “the pit” as\nopposed to “duh pit.” Why do some speak diﬀerently?)\n“They’re right,” Batwing said. “There’s only one way we\ndeal with our enemies, and that’s tossing them in the\npit. A good dropkick from behind—not too hard, eh, a little\nencouraging tap in the rear—and boom, one-way ticket to\nanother dimension. Suddenly, our problem is no longer\nour problem, just breakfast for some hungry Void\nbeast.”\nA tear ran down Clyde’s cheek. He spun around. “No!\nWhat are you saying?! We can’t do that! If we do, we’ll\nbe just as bad as EnderStar!” He paused. “Wait. Um …\nguys? What’s the pit?”\n“Oh. Okay. So that’s the pit.”\nSome say it goes on forever, but Greyfellow told me the\ntruth: It actually reaches the Void.\nWhen you fall in, you’ll fall for quite a long way. But\nafter some 6,570 blocks, you’ll eventually arrive in a\nbizarre world. A world of eternal night containing\ncrystalline plants, lakes of glowing blue ooze,\ninvisible things brushing past you and whispering into\nyour ear, and, yes, horrifying monsters.\nAt least, that’s what Greyfellow told me when I asked\nhim about it. Maybe he’s just trying to scare me?\nHe also said a race of peaceful mushroom\npeople live there, who know about such things as\n“advanced crafting” and “advanced\nbrewing.” Whatever that means.\nAnyway, thirty minutes later, over one thousand\nmonsters were standing around this seemingly\nbottomless hole that may or may not have led to a place\none thousand times crazier than the Nether.\nThe prisoner was standing on the very edge, his back\nturned to us. Batwing was right behind him.\n“Just say the word, Greyfellow, and I’ll dropkick this\npunk into a brand-new dimension!”\n“P-please,” the pigman said. “Me. No. B-b-b …b …b-\nbad.”\nThe endermage closed his eyes for what must have been\nseveral minutes.\nGhast tears were running down Clyde’s cheeks, and\ntwo witches were now trying to collect them.\nI stared at the pigman the whole time. Now where have I\nseen him before? That thing on his head. I saw a pigman\nwearing one of those before.\nWait a second! He was the guy leading all the other\nmonsters in the Overworld after EnderStar teleported away.\nHe was the smart one, the zombie pigman who could\nactually talk.\nWhat’s his name again?\nRarg? Yes! Rarg, the zombie pigman captain!\n“Very well,” Greyfellow said at last. “I have decided that—”\n“No!” I shouted. I walked up to Rarg and turned to the\nother monsters. “Wait! I’ve seen this pigman before!”\n“What? In the nether fortress?” Batwing said. “So what?”\n“In the Overworld,” I said. “I watched from a distance\nas EnderStar’s army panicked, blinded by sunlight.\nThey had no idea how bright the sun can be.”\n“What’s your point?” Greyfellow said.\n“Well, while I was watching them, I sensed\nsomething good in this pigman. Since he was\nwearing that thing on his head, he was the only one\nwho wasn’t blinded. He helped his fellow monsters return to\nthe Nether by singing a song so that they could follow\nhim.”\nThe endermage nodded. “I see, I see. Hmm . . . wearing a\nhelmet, yes. So, he’s quite smart. Hmm.”\n“Not only that,” I said, “I could somehow sense that he\ndidn’t want to be there. Didn’t want any part of attacking\nthe Overworld. He kept hesitating whenever EnderStar\nspoke to him.”\n“C’mon!” Batwing said. “You know we can’t do anything\nbut give this guy a good kick! He’ll give away our\nlocation if we don’t!”\n“Quiet,” Greyfellow said. He walked up to Rarg.\n“Pigman. Is it true? Do you really wish to abandon\nEnderStar’s army and join us?”\n“Y-yes,” Rarg said. “Me tired of boss man. And me\nhave many friends also tired of boss man. Boss man always\nscreaming. Always want us do bad thing. We don’t\nwant do bad thing.”\n“Then why didn’t you leave before?” Greyfellow asked.\n“We scared. Boss man make ﬁre from no ﬁre. Boss\nman make white zap light from no white zap light. Boss\nman also turn three me friend into ﬂying black\nsqueaky thing. Then he eat ﬂying black squeaky\nthing. Me so sad. Me so angry. When me see ﬂying\nblack squeaky thing …me remember. Me cry. Me want\nhelp beat him.”\n“Flying black squeaky thing?” Batwing facepalmed. “This\nis like talking to that kitten! Can you make sense,\nplease?”\n“He means bats,” I said.\n“Oh. Right.”\n“I’m no wizard, but I believe there’s only one spell that can\nturn someone into a bat,” Clyde said.\n“Yes.” Greyfellow’s expression grew even more serious.\n“Polymorph III. This is bad news indeed. He’s\nmuch more powerful than we thought.”\n“Why don’t we let Rarg join us, then?” Clyde asked. “If\nhe really does want out of EnderStar’s army, he can tell us\neverything he knows!”\n“Not a bad idea,” Greyfellow said. “He may also\nconvince his friends to switch sides and join us.”\nBatwing facepalmed again. “Man, don’t you guys know\nanything? We can’t take any chances! Listen, I’m a\nwither skeleton, okay? I grew up in that nether fortress. I\nused to be a bad mob. I know what bad mobs think. And\nhere’s what bad mobs think: bad things. EnderStar\nprobably sent him here and told him to say all of that\nstuﬀ. And, once we ﬁnally start trusting him and let him\nstay here and feed him mushrooms and slimeball\nstew and the many other nasty things his kind eats,\nhe’ll learn everything about us, go back to the nether\nfortress, and squeal like a …um …pigman?”\nThe other monsters seemed divided. Some nodded\ntheir heads in agreement with Greyfellow and Clyde, and\nothers were thinking along the same lines as Batwing. It was\na situation stickier than any slime.\nThen Rarg held out a stack of ender pearls. “Me.\nG-g-g …g-g . . .”\n“Give?” I asked.\n“Y-yes. Me g-give.”\n“W-where did you get those?!” Batwing cried out.\n“Me grab green things. From big red house. Me g-g …\ngive you. Okay?”\n“Interesting,” Greyfellow said, taking the stack of ender\npearls. “First the kitten, and now this.”\nRarg then held out a stack of gold bars. “Shiny\nthing. Me also take these. Boss man shiny pile. Boss man\nhave many shiny things in shiny pile.”\nHe dropped the stack on to the ground, then he retrieved a\nstack of shiny green rocks from his inventory and\nthrew them onto the ground as well. Many monsters\ngasped.\n“So many emeralds!”\nThis was followed by at least ﬁfty diﬀerent glass things\nﬁlled with water. Although, the water inside wasn’t blue but\npurple, red, and green.…\n“Potions, too?!”\n“Boss man tell me, always watch bottle things. Make\nsure no monster take bottle things. Why bottle things so\nimportant? Me wonder. But secret. Me try drinking bottle\nthing once. Me jump very high.” He chuckled. “Me\nlike bottle things.”\nAn unbelievable amount of items formed a pile at\nRarg’s big boots.\nThere were several books, like the one I’m currently writing\nin. Except, they shimmered purple. Was that due to\nmagic?\n“Enchanting books?!” a few monsters\nexclaimed.\nRarg also threw down a pile of shiny whitish-blue\nrocks. Those are called diamonds, apparently.\n“Boss man say shiny rock most good,” Rarg said. “No\neat shiny rock. Shiny rock hard. But shiny rock make good\nstab thing. Shiny rock also make good body thing, like on\nhead or feet.”\nAround me, the excitement of the other monsters\nﬁlled the air. They kept chattering away about emeralds,\ndiamonds, enchanted books, potions.…\n“Okay. Very last thing. Shiny metal. I ﬁnd in wood box.\nBoss man say this junk. But me think so pretty.”\nRarg the zombie pigman withdrew another rock from his\ninventory. Wait, no? It wasn’t a rock. It was a piece of\nmetal? It was bright silver and shimmered many\ndiﬀerent colors. It was so beautiful. The most\ncommon color by far was this dazzling shade of\ngreen.\n“Unbelievable,” Greyfellow said. “I don’t believe …\nthis is . . . quite surely, it can’t be.… My fellow\nmonsters, we are looking at a shard. One of the\nseven shards of Critbringer.”\nEveryone fell silent, and then:\n“Huh?”\n“Shard?”\n“Critbringer?”\n“What are you talking about, Greyfellow?”\n“It looks like a piece of metal to me.”\n“It is a piece of metal,” Greyfellow said. “But not iron.\nThat is adamant, a metal so rare in our time that\nit was thought to exist only in legend.”\nI remembered the old book Greyfellow had let me borrow.\n…Divine Weapons …all but destroyed during the\nSecond War. Only when their shards have been\nreunited can each Weapon be fully re-forged.…\n“You mean, this is from one of the sharp sticks mentioned\nin the book?” I said. “The swords, I mean.”\n“Exactly!” Greyfellow said.\nThe other monsters didn’t seem to understand. They\nlooked at each other with total confusion in their square\neyes.\nThe gray enderman scowled at them. “Fools! Have\nnone of you read of the Prophecy?! This piece of metal is\na fragment from the legendary sword\nCritbringer! A sword forged in ancient times, when\nmonsters far more powerful than any of you roamed in\ngreat number! Back then, weapons had to be strong enough\nfor land wyrms, lurkers, and other horriﬁc beasts\nyou cannot possibly imagine! This is one of the only\nweapons still in existence powerful enough to harm\nthe Eyeless One, whose real name I shall not\nutter here!”\n“Lurkers?” Batwing sighed. “Are those the giant black\nsquid-like things with one thousand tentacles and a\nsingle huge purple eye? The ones that live deep\nunderground? The reason why certain mineshafts are\nabandoned? The monsters that reduce the durability of\nyour items with a single glance? I thought those things were\njust a legend.” He shrugged. “Huh. Who knew?”\n“Fool!” Greyfellow grabbed the shard and turned to\nRarg. “I can see now that destiny has brought you to us.”\nThe enderman addressed the entire crowd: “No harm shall\ncome to this pigman! Free him at once and see to it that\nhe is introduced to our city!” He sighed. “I must go\nnow. I have much work to do. Kitten, come.”\nRarg turned to me. “Thank you, blue fuzz thing. You\nhelp me. Me so happy. You me friend now?”\n“Yes,” I said to Rarg. “Me you friend now.”\n“Breathe!” the endermage shouted. “Breathe!!”\n“I’m breathing,” I said. “I’m breathing! But as you\ncan see, your Grand High Endermage-\nness, no ﬁreballs are coming out!”\n“Try harder!”\nBreathe, breathe, breathe.\nNothing. Just little puﬀs of air.\nWe were back at Greyfellow’s place. The endermage was\ntrying to teach me how to use monster abilities.\nAs I exhaled over and over, a non-zombiﬁed pigman\nwho stood nearby saw me and started doing the same.\nMoments later: “O’gorg! Me pants-pants heavy now. I go\nbathroom now-now.”\n“Leave us at once!” the endermage shouted.\nThe pigman left. “Clyde! Clyde! Oh, where did that silly\nghast run oﬀ to?!”\n“I’m here!” the ghast called out. “What’s the\nproblem?”\n“Do you see that wall of obsidian?” Greyfellow asked.\n“Breathe a ﬁreball on it!”\n“Can you stop shouting?”\n“Now!!”\nAs commanded, the ghast drew in a deep breath, and—\nwhoosh!—spit out a large ﬁreball. It hit the obsidian\nwall nearby without any real eﬀect.\n“Now do it again! Keep doing it!”\nOne after another, I watched Clyde spit ﬁreballs at the\nobsidian wall. “Good!” the enderman said. “Now, kitten.\nYou try.”\n“Sure thing.”\nBreathe! Breathe! Breathe!\nPretty pathetic. Not even a puﬀ of smoke.\n“You aren’t trying hard enough!” Greyfellow shouted.\n“Try!!”\n“I am trying!” I shouted.\n“Try harder!!”\n“I am!!”\n“There’s a large chance your homeworld is going to be\ndestroyed, kitten! Do you understand?!”\nI hissed. “Hey! Stop freaking out, okay?! For the past\nhour it’s been ‘Jump here! Swim in that lava over\nthere! Go invisible! Magically spit out ﬁreballs as if\nyou’re a—’”\nSuddenly, my whole body shook.\nCough, hack.\nAhackckahackahack.\nHackhackhackackackkkkkkkkk.\nWhat’s wrong with me? This is so painful! It’s like\ncoughing up a hairball but ten times worse!\nI coughed up a ﬁreball instead. It was a tiny thing,\nmaybe ten times the size of a spark. It ﬂew out of my mouth\nand wobbled through the air. There was a sad little sound\nas it did: p’tweeeeeeeeeeee.…\nThis tiny ﬁreball, ﬂying so slowly (slower than a zombie\npigman walking) slowed down even more the more it ﬂew\ntoward the wall. It continued making that little noise:\neeeeee.…\nWe all watched as it continued to ﬂy forward\npathetically. It literally took twenty seconds to travel a\ndistance of nine blocks. Finally, there was a slight\nsputtering sound as it hit the wall and vanished.\nI coughed again. A little puﬀ of smoke came out. For a\nlong time afterward: silence.\nI looked at Clyde. Clyde looked at the enderman. The\nenderman looked at me. I looked at the enderman. The\nenderman looked at Clyde. Clyde looked at me. Then we\nall looked at the small obsidian wall my tiny little\nﬁreball had struck.\n“I don’t believe it,” Greyfellow said. “The\nProphecy! It really is true!”\nClyde started spinning around frantically. “So cool,\nEeebs! Wow! I knew you could do it!”\n“Yeah, yeah, not bad, kid!” Batwing was standing in\nthe doorway, now. “So, you’re some kind of mutant,\nhuh?”\nMoments later, I heard a familiar voice. A girl’s\nvoice. Most of all, it was the voice of a kitten.\n“Hey?! Eeebs?! What was that?!”\nTufty and Meowz were also standing in the doorway.\nMy friends from the Overworld. Strangely,\nalthough I recognized them, they no longer looked like\nkittens. Not really.\nBig claws.\nRidiculously long ears.\nAs a matter of fact, and, as strange as it\nsounds,\nwell … they almost kind of looked like\nme.\nYesterday, I breathed ﬁre.\nAt the same time, my friends showed up, Tufty and\nMeowz. They were pretty much in the same boat as I\nwas several days ago: clueless.\nThey still resembled their former selves. Tufty was still\norange-ish. Meowz was still mostly white. However, they\nlooked scary now. Like an-enderman-staring-at-you-in-a-\ntotally-dark-room-making-weird-little-noises-with-only-its-\nglowing-purple-eyes-being-visible scary. Actually, worse\nthan that. Like my-mom-calling-me-by-my-full-name-\nand-threatening-to-make-me-eat-puﬀerﬁsh-casserole-for-a-\nweek scary or human-trying-to-tame-me-with-a-pumpkin-\ninstead-of-a-ﬁsh scary.\nMeowz crept into the house. “Eeebs?”\nTufty followed her in with his tail between his legs.\nThe endermage, Greyfellow, nearly fainted upon\nseeing them. He turned to Batwing. “I can’t … I don’t …\nwhat is happening, Batwing? Yesterday, everything was so\nnormal. I was drinking some redstone tea, thinking\nabout what to craft. Then this kitten shows up with the\nmark. Then a zombie pigman not only joins our side but\nhands over EnderStar’s treasure horde.\nThen, the kitten actually breathes ﬁre. I’d never believed\nin the Prophecy myself!\nDid you? And now two of his friends arrive, apparently\nChosen as well.…”\nHe trailed oﬀ and appeared to be looking at something\nfar away.\nBatwing sighed. “Three kittens as Chosen Animals.\nWhy couldn’t it have been something way more crazy,\nlike a chicken and a donkey? A bat and a cow?”\n“I was hoping for a squid and a pig!” Clyde said. “I read\nabout squids, once.”\n“Anything but three kittens.” The wither skeleton\nnudged Greyfellow.\nThe endermage mumbled absently, still staring ahead: “I\nlike redstone tea … and … kittens … three kittens …\nwhat does it mean … ?”\n“So, these are your friends, Eeebs?” Clyde\nsmiled. Well, he didn’t, really, but he didn’t sniﬄe or\nanything like that, and his frown vanished. That’s pretty\nmuch like smiling for a ghast.\n“Yes,” I said, approaching Tufty and Meowz.\n“We came across the witch,” Meowz said. “She told us\neverything.”\n“We didn’t believe her when she said we could use the\nabilities of monsters,” Tufty said. “It’s true,\nthough. This is so cool! How can I breathe ﬁre like that?”\n“You guys really shouldn’t have followed me,” I said.\n“Really. You don’t know what you’ve gotten yourselves\ninto.”\nMeowz looked like she was about to cry. “Eeebs?”\n“Yeah.”\n“What’s happening?”\n“About that, purrrr …”\nI tried telling them about the Prophecy, and I\nshowed them Greyfellow’s book. It was hard for me to\nexplain everything to them, and the endermage wouldn’t\nchime in and help me out. He just kept babbling on\nabout redstone tea: how he liked it warm although not too\nwarm, how he added some crushed ﬂower petals like\nblue orchids to the recipe to make it taste better, how he\nthought it further improved the taste and added “more\nkick” when he made it using a brewing stand instead of a\ncrafting table.…\nI turned to the endermage. “Hey? Greyfellow? Who\nwrote this book, anyway?”\n“… it’s the bubbling process,” he mumbled. “A brewing\nstand aerates the tea, providing a more crisp and\nrefreshing ﬂavor.…”\nMy ears and tail lowered, I started thinking that after\nlearning how to spit ﬁreballs, my next power was going\nto be to shoot smoke out of my ears.\n“Right,” I said. “Forget about who wrote it, then. What I\nreally mean to ask is, how did they know all of this stuﬀ was\ngoing to happen? How did they know three animals\nwould be changed?”\nGreyfellow nodded. “Why, yes … pink tulip certainly\ntastes better than oxeye daisy, yes … yes, indeed.…”\n“Um, what’s wrong with him?” Batwing said.\nClyde shrugged. Well, Clyde has no shoulders—he’s just\na giant white block with a face, really—but, anyway, for\nsome reason I felt that he shrugged. “Too much has\nhappened today.”\n“You could say that.” The wither skeleton glanced out the\nwindow. “I’ll go check on Rarg and see if he’s okay. Listen,\nEeebs. Why don’t you hold oﬀ on telling your friends about\nthe Prophecy till our endermage friend here isn’t\nbumbling around like a land squid? In the\nmeantime, you can show your friends around the city.\nCool?”\n“Sure,” I said, glancing at the two nether kittens. “Shall\nwe?”\nThe three of us left Greyfellow’s hut. I didn’t freak out at\nthe sight of my friends, not even then. I was still so\nshocked by everything. I was about to join the\nendermage. If just one more crazy thing had happened,\nI’d have started mumbling about puﬀerﬁsh cookies:\nhow to align the eggs, milk, and sugar pixel by pixel on\nthe crafting table in a purrfect way to achieve a ﬁve-star\nrating from the International Minecraftian\nBaker’s Society, in not only consistency but also\nform and texture, the lightness of the bread, crisp yet\nnever crumbling, with each tiny cube of sugar and baked\npuﬀerﬁsh spread evenly throughout the biscuits to achieve\na pastry both magniﬁcent to the eye and simply\nbursting with ﬂavor.\nBut then I wasn’t sure if the International\nMinecraftian Baker’s Society had such a\nreﬁned taste as a nether kitten’s, and soon I began to\nwonder whether any of them would appreciate the\nelegance of a cookie made of equal parts sugar and ﬁsh.\nSpeaking of Greyfellow.\n(Wait … I wasn’t speaking of him. Whatever.)\nAnyway, here are a few drawings of his house.\nWell, I showed my friends around Good Mob City.\nWe didn’t talk much, though. They were just as silent as\nme.\nI mean, all of this stuﬀ has happened so fast. Just a week\nago, we were playing hide-and-seek. Now, we’re nothing\nlike our former selves. We’re supposed to help save the\nworld.\nAn hour or so later we headed back to the gray enderman.\nHe’d ﬁnally calmed down a little.\n“Sorry about that,” he said. “I just couldn’t believe it. Still\ncan’t. The Prophecy really is true?! Which means …\nour world is going to suﬀer through yet another Great\nWar.”\n“What are we supposed to do?” I asked, getting straight\nto the point.\n“Hmm. First, let’s try something. Kittens, I want you to\nthink about the word ‘ability.’ Or just imagine your\nabilities in general. Picture them in your mind.”\nTufty must have thought of his abilities ﬁrst.\nSeconds after the endermage spoke, a gray screen\nappeared before the orange nether kitten. This screen was\ncompletely ﬂat, two-dimensional, and seemed to be\nmade out of colored light.\n“Wow!” Meowz waved a paw through Tufty’s screen,\nand it passed through without any resistance. “What is\nthat thing?”\n“Those screens are called visual enchantments,”\nthe enderman said. “They can be used to interact with\nobjects or your inventory, or they can simply display\ndata.”\n“And what are abilities?” Tufty asked.\n“All monsters have abilities,” Greyfellow said. “Creepers\nmove silently. Endermen teleport. Zombies break\ndown doors. Of course, you kittens have more\nabilities than any normal mob.”\nI tried to concentrate on the word “ability.”\nA screen appeared before me as well.\nThe enderman then told us that we could either touch\nan ability’s name on the screen or focus on it with our\nmind to access another screen. This screen would tell us\nmore about that speciﬁc ability.\nWhen I batted at the words “Obsidian Fur” with a paw,\nthe words upon the screen changed to:\n“If you want to go back to the ﬁrst screen,” Greyfellow\nsaid, “just concentrate on that word. ‘Back.’ Or you could\nspeak it out loud.”\nI tried the latter. “Back.”\nThe visual enchantment screen returned to its former\nstate.\n“Interesting.” Touching the screen with her paws,\nMeowz began browsing through all of her abilities.\nI did the same, pawing down the list, accessing each sub-\nmenu, reading it, and saying the word “back” in my\nmind each time.\nHere’s a full list of my abilities:\n(I’m guessing “INT” means intelligence? I have no idea\nwhat “AI” means and neither does Greyfellow.)\nThe endermage said an ability’s level is a measure of how\npowerful it is. So, most of my abilities are still pretty\nweak. But they won’t be like that forever!\n“By the way, energy is used for abilities,” the\nenderman said. “Spells, too. Using abilities and casting\nspells drain your energy bar. That’s why Eeebs\ncould breathe only one ﬁreball yesterday and only puﬀs of\nsmoke afterward. Energy slowly recharges over time.\nSo it’s best to use your abilities only when you\nabsolutely need them. Like most monsters, you\nhave a maximum of 100 energy.”\n“How do we know how much energy we currently have?”\nTufty asked.\n“That’s the yellow bar in your HUD, or heads-up\ndisplay. Simply concentrate upon the word ‘HUD’ in\nyour mind, and it will appear across the bottom of your\nvision. If you are injured, hungry, drained of energy, or\ndebuﬀed in any way, your HUD will automatically\nappear, as a kind of reminder, until your condition\nimproves.”\nOkay, let’s try it: HUD.\nAs soon as I thought this, a bunch of stuﬀ appeared\nacross the bottom of my vision, just like the enderman had\ndescribed.\n“The hearts are a measure of your life force,”\nGreyfellow said. “Each heart represents two hit points.\nBy the way, I’m curious. How many hearts do you have?”\nEach of us replied with the same number:\n“Ten!”\n“Twenty hit points, then. Not much. You’ll gain\nmuch more as you grow stronger, though.”\n“What about the gray shirt things?” I asked, not\nwanting to think about what would happen if all of my\nhearts were removed.\n“That’s a visual indicator of your protection, otherwise\nknown as armor. The more armor you have, the less\ndamage you will take. Some forms of damage bypass\narmor, however.”\n“How about the boxes?”\n“Your hotbar. You can secure items to your body—with\nthe help of a belt, for example—or in an easy-to-reach\nlocation in your inventory. You may then access those\nitems quickly.”\nAll three nether kittens exchanged glances:\n“Inventory?”\nThe enderman then explained how we each have an\n“extra-dimensional space” that lets us carry many\nitems. We only have to say “inventory” in our minds for\nthe inventory screen to appear. That must be how Batwing\nwithdrew the tellstone from what looked like thin air:\nHe accessed his inventory.\n“Your inventories are currently quite small,”\nGreyfellow said. “You can increase the size of your inventory\nby wearing a container, like a belt pouch. There are even\nenchanted containers that dramatically increase\nyour inventory space. Sadly, such items, enchanted or not,\nwon’t be easy for kittens to wear. They aren’t normally\ndesigned for animals. An easy way around that, if you felt\nthe need to carry many items, would be to level-up your\nPack Beast ability.”\nTufty blinked. “Um, can you repeat that? I’m\ntotally confused.”\n“Same here,” I said. “I guess that means we\nreally need to level-up our Higher Intelligence\nability, huh?”\nAfter we played around with our visual\nenchantment screens, a question spawned in my mind.\n“Say, how do we get stronger, anyway? And how can\nour abilities gain levels?”\nThe enderman gave me a strange look. All of his\nexpressions were strange, really, but his expression then was\nas if I’d just asked why zombie pigmen are purple and have\nice cream cones for heads.\n“By doing your job,” he said.\n“And that is?”\n“Turning Herobrine’s and EnderStar’s minions into\nclouds of smoke. Every time you defeat one, you’ll absorb\nsome of its power. Of course, you’ll also grow stronger by\nquesting.”\nQuesting … ?\nBefore anyone could even ask for clariﬁcation, more\nscreens appeared before us.\nLike with the ability screens, simply thinking about the\nword “quest” conjured what could be called a “quest\nscreen”:\nSadly, Tufty and Meowz had diﬀerent messages on their\nquest screens.\n“What does all of this mean?!” Tufty said. “It’s so\nweird!”\n“I have to agree,” Meowz said. “I’m so confused I could\nhiss! It’s not fair, you know? We’ve been chosen to help\nsave the world, and all this new stuﬀ is being thrown at\nus, and we don’t even get classes or something?”\n“It does seem an awful lot has been thrust upon you\nkittens,” Greyfellow said. “A heavy burden, indeed.\nI am doing my best to teach you, but there are many\nthings I do not know. Eeebs, I do suggest returning to the\nOverworld as soon as you can. Once there, the ﬁrst place\nyou should head to is the capital. Ask around for the\nLibrary. One of my colleagues there knows much\nabout the Prophecy and may be able to help you locate\nthat villager.”\nAs he said this, I tried piecing everything\ntogether in my mind.\n1. We’re supposed to help ﬁght against the Eyeless\nOne, otherwise known as Herobrine.\n2. We’ve been given abilities, and we have these\nthings called quests—tasks we’re supposed to\ncomplete.\n3. My ﬁrst quest is meeting up with that villager. A\nvillager I don’t know anything about. Is it a boy or a\ngirl? What’s his or her name? Why do I have to\nserve that villager, anyway? What, am I just a pack\nkitten or something? I thought my role in all this\nwould be a bit more glamorous than that.\n“My friends really have to stay here?” I asked.\n“I believe so. Your quests were given to you by the\nImmortals themselves. It would be wise to follow\nthem.”\n“That’s not fair!” Meowz said. “I don’t want to stay\nhere anymore!”\n“You can’t be serious,” Tufty said. “We can\nlearn more about our powers! How cool is that?\nBesides, don’t you want to help save the world?”\n“Yeah, it’s just … I already miss my family.”\n“At least you don’t have to go into the Overworld alone,” I\nsaid, “looking like this.” I turned to the enderman.\n“What about Clyde? Can he go with me?”\nThe endermage avoided my gaze. “Well, I … um … it’s not\nexactly written in the Prophecy. Plus, I’m not sure\nwhether a ghast could even survive in the Overworld for\nany length of time.”\nOh, man.\nI didn’t want to be a hero anymore. Not without him.\nHow could I leave my best buddy behind? I’d just\ncaught up with him again!\n“There has to be a way,” I said. “I really want Clyde to go\nwith me. He’s so smart. Besides, I know he’ll want to.”\n“It’s up to him,” Greyfellow said. “I will warn you that\nconstant exposure to sunlight could weaken him,\npossibly even kill him.”\n“Maybe he’s right,” Meowz said. “Once you return to the\nOverworld, you’re going to scare enough people as it is. A\nhuge ghast ﬂoating behind you certainly won’t help any.”\nWhat will Clyde do once I tell him he can’t go with me? I\nthought. Maybe it’s for the best. The witches seem to\nlike ghast tears, and after I tell Clyde that he can’t tag\nalong, their inventories will be overﬂowing with them.\n“There’s one more thing I’d like to try,” the enderman\nsaid. “Please follow me.”\nTo our complete amazement, Greyfellow then\nwhirled around … and stepped into the back wall\nof his house!\nTufty and Meowz had no idea what was going on. But I’d\nheard about shadow blocks and remembered how you\ncould walk through them. In other words, the\nendermage was taking us to his secret chamber.\nNow, I’d never really met a wizard before. At this point,\nI had no idea that most wizards even had something called\n“secret chambers,” much less how cool\nsecret chambers might actually be.\nI saw a lot of new stuﬀ today and learned a lot of new\nwords. Such as “brewing stand.” And “anvil.” And\n“crafting table.” And “enchantment table.”\n“This is called a rune chamber,” the enderman said.\n“Do you know what it does?”\nI glanced at the giant silvery box. Even though it\ndidn’t look all that scary, it scared me all the same.\n“Errr, no?”\nTufty wasn’t scared, though. He immediately zoomed\ninside. “Is this like a house?” he asked, sniﬃng the silvery\nmaterial.\nMeowz ran inside as well. “Wow,” she said, lifting up\nher paws, as if the silver material (“iron,” I learned later) was\npainful to the touch.\nShe left the box as quickly as she’d entered. “It’s\nfreezing in there!”\n“Indeed it is,” the enderman said. “It contains a most\npowerful form of magic. Only three wizards in\nall of Minecraftia know how to create such a device.”\n“What does it do?” I asked.\n“It makes you stronger,” he said. “Stronger than you\nalready are, I mean.”\nStronger than I already am? Even if I didn’t know how it\nmade me stronger, it sounded good to me. Is there any\ndownside to having more super powers? Basically\nno.\n“A rune chamber can permanently enchant an\nanimal or monster,” he said, “granting them additional\nstrength, defense, and so on.”\n“What’s ‘enchant’?” Meowz asked.\nThe enderman shook his head. “Sorry. Not ‘enchant.’\nEnchanting is more for items, physical objects. The technical\nterm is ‘enhance.’ A rune chamber can be used to\nenhance you. But let’s just call it enchanting to make things\neasier.”\nTufty stepped out of the rune chamber, shivering. “S-so,\nit m-makes us more p-powerful?”\n“Yes. And I would like to see whether it’s possible to aﬀect\nChosen Animals.” Greyfellow’s eyes glowed more\nbrightly as he glanced at us. “Are any of you willing to serve\nas my … test subject?”\nThree little paws ﬂew into the air at the same time.\n                “Me!”\n                “Me!”\n“Me!”\nTufty lumbered toward the chamber again, but Meowz\ngrabbed his tail. “I called it ﬁrst!” she hissed.\nHe grumbled. “Whatever. Don’t freeze your tail oﬀ, huh?”\nWith a smirk, the white nether kitten zoomed into\nthe rune chamber. “How long do I have to wait in here?”\n“Not too long.” As the enderman said this, a gray\nwindow appeared in the air before him. It contained many\nboxes. In one box was an image of Meowz.\nHe placed a blue cube into one of the boxes. “That’s called\nlapis lazuli,” he said. “It’s used for this type of thing.”\nThe cube disappeared, and a ﬂat image of the cube\nappeared in the box.\n“Almost done,” he said. “The process should take only a\nfew seconds.”\nSuddenly, there was a bright white ﬂash from inside\nthe chamber. Meowz made the biggest and most terriﬁed-\nsounding screech before jumping out.\n“Mreeeeeeeeeeew! What was that?!“\nGreyfellow smiled. “That was you being enchanted.”\n“Really? I don’t feel any diﬀerent.” A screen appeared\nbefore her moments later.\n“Look,” Tufty said. “Your claws are kind of purple\nnow.”\nMeowz held out one of her paws. Indeed, her black claws\nhad a faint violet glow, just like the books Rarg\nhad dropped earlier.\nIn addition, faint little shapes, almost like weird-\nlooking letters, could be seen upon the surface of her claws.\nThey were also violet, slightly brighter than the glow itself.\n“This means I can do more damage?” she asked.\n“A little,” Greyfellow said. “Rend I isn’t very powerful.\nSadly, you’re not strong enough for anything beyond that.”\nGreyfellow turned back to the chamber.\n“Okay. Who’s next?”\n(10 minutes later …)\nSo, I’ve been modiﬁed with Rend I.\nEvery bit helps, right?\nIt feels kind of girly having glowing purple claws, but\nwhatever. I don’t care if my entire body turns bright\npink, so long as it means I no longer have to run from\nwolves.\nThe rest of the day was spent training. After Tufty and\nMeowz coughed up their own ghast ﬁreballs, we inched\nsilently across soul sand like creepers, climbed\nup netherrack walls like spiders, sprinted like\nzombie pigmen, placed a few items in our\ninventories, and then swam in that orange ﬁre stuﬀ—err,\nlava—for over an hour.…\nThere’s a huge lake of that stuﬀ in the center of the city.\nThe mobs often go swimming there. They call it a “pool.”\nAnd today, that lava pool was ﬁlled with hundreds of\nmonsters—a “pool party.”\nSwimming in lava was so terrifying at ﬁrst! It took me\nten minutes before I could dip one of my paws in. But it\ndidn’t burn. Didn’t even hurt! Lava is like warm water to\nme now.\n(I still haven’t tried drinking it yet. That’s on my to-do list.)\nBy the way, Batwing is immune to lava, too! So, I didn’t\neven need to save him! But he’s terriﬁed of swimming\n… Greyfellow actually had to push him in.\nClyde was swimming, too.\nYeah, I haven’t told him yet. I keep thinking about\nhow I can say it without hurting his feelings.\nI know he’ll want to go with me, and I want him to\ncome too, but … I don’t want him to get hurt. I remember\nwhat the sun did to the zombie pigmen and the blazes.\nMaybe Clyde could wear a helmet? No, probably not.\nGreyfellow could sense how I was feeling. He waded over\nto me. “Still thinking about your friend, Eeebs?”\n“Yes. I’ll miss him. I’ll miss all of them. I’ll even miss\nyou. Thanks for teaching us.”\n“I’m glad I could help,” the enderman said. “Listen. Your\nfriend, Clyde. There is a way he could go with you.”\n“There is?”\nThe enderman nodded. “One of the enhancements that\nrune chambers oﬀer is Sunlight Protection. Shall we\nask him about this?”\n“I suppose,” I said. “But I want it to be his choice.”\n“Of course. Also, I have something you’ll need for your\nreturn to the Overworld.”\n“What is it?”\n“I’ll show you tomorrow. I think you’ll like it.”\nThe following morning, I was holding one of those bottle\nthings: a “potion.”\n“That’s a Potion of Disguise I,” Greyfellow said.\n“Villager variant. Simply drink it and it will seem as though\nyou are an ordinary villager.”\nClyde stared at the red liquid contained within the\nglass. “Will Eeebs still be able to use his abilities?”\n“Yes. Disguise is merely an illusion. Regardless of\nwhich form you take, you’ll still be able to do everything you\ncould before. Go on, Eeebs. Don’t be afraid. Drink\nup.”\n“Whatever,” I said. “Here goes.”\nI chugged the potion. The taste … yuck! It was like grass\nmixed with cobblestone. (Don’t ask how I know what those\ntaste like.)\nThin white smoke appeared all around me. To the\ngasps of my friends, I glanced down at myself and found\npale skin and brown robes instead of dark blue fur.\nThe endermage smirked. “Of course, you’ll need to\npractice standing on your hind legs for the illusion to be\neﬀective.”\n“Right.”\nI tried standing up but fell to all fours again.\nMeowz began rolling around on the ﬂoor: “Hahaha …\nthat’s just … wow, I can’t.…”\nSoon, what appeared to be a very real and ordinary\nvillager (me) stood before everyone. Although I was\nwobbling around on my feet.\n“That potion has a duration of only one hour,” the\nendermage said, “so I’ll brew half a stack for you.\nMake sure to drink one before going into any town or village.\nIf you must remain there for any length of time, drink\nanother before the eﬀects wear oﬀ.”\n“How will I know how much time I have left?” I asked.\n“See that icon in the lower left corner of your vision?”\n“Got it. Hey, what about Clyde?”\n“What about me?” Clyde asked.\n“Oh, man.” Batwing lowered his head. “You mean, you\nguys didn’t tell him yet?!”\n“Well, um …”\nThe ghast sniﬄed. “Tell me what, Eeebs?”\n“I’m going to the Overworld,” I said. “It’s part of my\nquest.”\nA single tear fell down the ghast’s cheek. “I see. So,\nyou’ll be gone for good?”\n“No way,” I said. “Come on, Clyde. I’ll come back. The\nNether is just as much my home now as the Overworld is.”\n“All right. Then I guess there’s no reason to be sad,\nright?”\n“If you want, you can come with me.”\n“I can? How?”\nThe enderman then chimed in with how it was possible to\nprotect him from sunlight. “It won’t make you\nimmune,” he said, “but you’ll be all right.”\n“But it’s your choice,” I said. “You have to decide for\nyourself.”\n“Then I’m staying,” Clyde said. “You know the\nOverworld, Eeebs. It’s best for you to go alone. I’ll stay\nhere and help protect the city in case EnderStar ﬁnds\nus.”\nPurrrrrrr.\nThat was way easier than I thought.\nAnd Clyde was right. He would be way more useful\nhere. “You’re sure?” I asked.\n“Deﬁnitely. I know we’ll meet again.”\nAnd the ghast actually smiled. I mean actually\nsmiled. It was like seeing a ﬂower growing in the\nNether.\nI nodded.\n“We will.”\nAnd so it seemed I was ﬁnally ready\nto venture into the Overworld.\nWith Rarg’s assistance, the mobs here will try\nrecruiting mobs from the nether fortress and work on\ndefeating EnderStar.\nI want to help with that, of course, but my destiny lies\nelsewhere. Still, Greyfellow suggested that it might be\npossible for the mobs here to join forces with villagers in the\nOverworld. Together, we could take out EnderStar ﬁrst\nthen deal with Herobrine later.\n“That really depends on whether anyone in the Overworld\nis willing to help,” Batwing said. “Seems unlikely. But\nthen, those villagers I spoke to were diﬀerent from normal\nvillagers.”\n“In what way?” Greyfellow asked.\n“Seems like they’re training to be warriors. They\nknow how to wield swords, at least. In fact, they appear to\nhave helped ﬁght oﬀ several large attacks.”\n“Coordinated attacks?”\nBatwing shrugged. “If your little crystal was\naccurate, then yes. The mobs were clearly working\ntogether.”\n“So, the Eyeless One has already begun to amass\nhis army.”\nThe endermage nodded. “This is no surprise.\nWe already know that the Prophecy is true. The Great\nWar will soon begin.”\n“Do you think it’s possible that one of those villagers is the\none mentioned in that book?” Batwing asked.\n“Perhaps. Perhaps that is why you were able to speak\nwith them.”\n“Why two, though? I thought there was only one\nChosen Villager? Well, actually, no. Three. I spoke\nwith a third villager once. What was his name, again?\nPebble?”\n“I don’t have any answer for that,” the enderman said. “In\nfact, there is much I do not know. The tome I have\nregarding the Prophecy is incomplete. Many pages have\nbeen removed.”\n“One more thing,” Batwing said. “Does the Eyeless\nOne know about tellstones?”\n“I’m not sure,” the endermage said. “Why do you ask?”\n“Because that one villager, Pebble, said the Eyeless\nOne was speaking to him in his dreams. Told him\nthat Runt was a spy. A traitor. He appeared in\nPebble’s dreams at least ten times.”\n“Why would Herobr—the Eyeless One take such an\ninterest in their village?”\nThe wither skeleton shrugged. “Beats me. My only\nguess is he’s aware of the Prophecy as well and\ndiscovered the identity of the Chosen Villager.”\n“Yes, I suppose you are correct. Hmm.”\nA villager, two kittens, and a ghast remained silent before\nBatwing and Greyfellow, trying to understand these\nmysteries.\nBatwing seems to know a lot about what’s going on, I\nthought. And he’s always talking to Greyfellow. He must be\nreally important?\nAs I listened, a realization suddenly hit me. If Batwing is\ncorrect, then one of the villagers he spoke with is the\nsame villager I’m supposed to meet.\nBreeze. Runt. Pebble. I’m writing these names\ndown here so I don’t forget them. I should try to locate\nthem in the Overworld as soon as possible. It’s my\nquest, after all.\n“I have a question,” I said.\nThe endermage turned to me. “What is it, Eeebs?”\n“Well, you said that I should head to the capital city\nﬁrst. But I’m supposed to meet up with that villager, right?\nWhat if he’s not in the capital?”\n“Hmm. Batwing, do you recall seeing any buildings\nwhen using the tellstone?”\n“A few times,” the skeleton said. “Runt had a nightmare,\nonce. His village had been overrun.”\n“So, he is in a village, then?”\n“I believe so.”\n“Did you see any buildings made of quartz or clay?”\n“None. Wood and cobblestone, mostly. There was a\nwall in the distance. Their village was surrounded by a\nhuge cobblestone wall.”\n“Interesting.” The endermage closed his eyes for a\nmoment. “That sounds more like a town, not a village. You’re\nsure they were villagers?”\n“Hey, I’m sure,” Batwing said. “Both Runt and Pebble\nhad shaved heads and huge noses, while that girl had\nsuper long hair and a little nose. Sound like villagers\nto you, bud?”\n“Certainly. I’ve just never heard of a village with a\nwall before.”\n“Maybe they’re smarter than the average villagers?”\n“Maybe. Hmm.” The enderman closed his eyes again.\n“Warriors, you said. Training to be warriors. Why does\nthat remind me of something?”\n“Same here,” Batwing said. “Wait a second. I thought there\nwas a village in the east like that? Real serious folk.\nKids start training for combat at the age of six.”\n“That almost sounds like Shadowbrook,” the\nenderman said. “A village of proud warriors. Hmm. Batwing,\njoin me in my library. We have much research to do.”\nThe enderman turned to me. “I’ll give you your answer\nsoon, Eeebs. For now, rest. Spend time with your friends.\nAfter today, you won’t have much time for\neither.”\nAfter wandering around the streets, I ﬁnally found Rarg.\nHe was in the center of the city, at the edge of the lava pool,\nstaring oﬀ into space.\n“Hey, Rarg.”\n“Hi-lo. Me friend. Me again want say. Thank.”\n“No problem. Somehow I just knew you were a good guy.\nI’m glad you joined us.”\n“Me too. Boss man crazy. But boss man now-\nnow no boss man me. Now-now boss man me tall gray\nblink man. Tall gray blink man no angry-say make me\nblack ﬂying squeaky thing.”\nUm … What’s he talking about?\nOh. He’s saying EnderStar is no longer his boss.\nHe now takes orders from the endermage. He doesn’t mind,\nbecause Greyfellow doesn’t threaten to turn him\ninto a bat.\nI’m guessing “angry-say” means yell? And\n“blink” must mean teleport.…\nWhat’s “now-now,” though? Why is it\nrepeated?! Why do zombie pigmen talk so strangely?!\n“Yes,” I said. “Tall gray blink man no angry-say\nyou. But angry-say me, me no know breathe ﬁre. But. Tall\ngray blink man happy man. Most time.”\n“He smart also.”\n“Yes.”\n“You. Name. Eee … bu?”\n“Eeebs,” I said.\n“Eee … buzz.”\n“Close enough.”\n“Eeebuzz? Me want know.”\nHe wants to ask me a question? Hmm, I’m getting better\nat this.\n“You what want know?” I asked.\n“You go? You go where-where?”\n“I go big light.” I pointed at the cavernous\nceiling far above. “Big blue. Yellow square. You know?”\n“Me know. Me no like big blue. Big blue scare me.\nAnd me eyes hurt me look big yellow square thing.\nEeebuzz? Me also want know.”\n“Yeah?”\n“You. No feel real?”\n“What you say me no feel real?”\n“No know. No know. Me no know how say.”\n“What you say you no know how say? Me no know.”\n“Me think some time me no real. No know how say.\nBut me no-no feel real. You?”\nHe’s saying he doesn’t feel real? What does he mean by\nthat? Actually, sometimes, I kind of get that feeling.… I just\nassumed it’s from all the stress lately?\n“Some time,” I said. “Yes. Me also no-no feel real.”\n“Why you me no-no feel real?”\n“Me no know.”\n“Me also no know.”\nRarg held up a ﬁsh. I’d never seen that kind of ﬁsh before.\nIt was dark red in color.\n“Me use wood string thing,” he said. “Me know\nhow use wood string thing. Wood string thing get red\nswim-swim. You want eat?”\n“Me no want eat. Me eat, you no eat.”\n“No. Me many red swim-swim.”\n“Okay.”\nHe handed me the red ﬁsh, and I bit into it. It was the\nbest ﬁsh I’d ever tasted.\nHe then pulled another red ﬁsh from his inventory and\nate it in seconds. He grinned. “Hee hee! You like?”\n“It’s delicious,” I said, taking another bite.\n“Delishi … ?”\nA blank look, until I clariﬁed: “Me think red swim-swim\nyum-yum.”\nWait a second. Where exactly did he get a ﬁsh like that?!\nThere’s no water in the Nether!\n“Rarg. Where you get red swim-swim huh?”\nHe pointed to the lava pool. “There-there. Orange ﬁre\nwater.”\nSeriously? He caught a ﬁsh in the lava?! There’s such a\nthing as lava ﬁsh?!\n“How you get? Can show me wood string thing now-\nnow huh?”\n“Okay.”\nHe pulled a strange-looking item from his inventory.\nIt appeared to be a stick with some spider string\nattached. At the end of the string was something I didn’t\nrecognize.\n“You want try? I try now-now. You see me try.\nOkay?”\n“Okay.”\nFor the next hour or so, Rarg showed me how to ﬁsh. As\na cat, we usually just dived into the water, but this wood\nstring thing made things way easier.\nStill, using that tool was diﬃcult for me at ﬁrst, as I had\nto stand up on my hind legs. Standing was something I\nstill needed to practice.\nAnd Rarg wasn’t lying. I eventually caught a lava\nﬁsh of my own, to my complete surprise.\nI’d originally wanted to ﬁnd Rarg to see whether maybe\nBatwing had been right about him being a spy. But as we\nsat down at the edge of the pool, eating lava ﬁsh in\nsilence, I knew that he was just as innocent as me—\nanother little piece in what at times felt like some kind of\nweird game.\nI curled up next to my friends on the pink carpeting of the\nendermage’s house.\nStill, I couldn’t sleep. I just kept thinking and thinking\nand thinking. About the upcoming war. About my abilities.\nAbout my quest. Plus I could hear Greyfellow and\nBatwing chatting, although I couldn’t make out what\nthey were saying.\nThey were in the secret chamber, I guess.\nAt last, I crept over to Greyfellow's huge bookshelf\nand glanced at a few books on the very bottom. This section\nwas labeled “junk.” When I grabbed several of the books, I\nquickly understood why.\nI’m not sure why, but I decided to check out Diary of a\nMinecraft Grass Block. There was an introduction, and it\nread:\nThere was once a Minecraft grass block named\nMinecraft Grass Block. Minecraft Grass Block liked doing\nthe things most Minecraft grass block children did.\nMinecraft Grass Block wanted to learn how to be a better\nMinecraft grass block, but how would Minecraft Grass\nBlock become a better Minecraft grass block than the\nother Minecraft grass blocks who hoped to become\nbetter Minecraft grass blocks, or at least better Minecraft\ngrass blocks than Minecraft Grass Block was at being a\nMinecraft grass block and hopefully even the best\nMinecraft grass blocks a Minecraft grass block could\npossibly become?\nJust turn the page, and follow the adventures of\nMinecraft Grass Block in this Minecraft Grass Block Diary\nof a twelve-year-old Minecraft grass block named\nMinecraft Grass Block, a Minecraft grass block boy who\nhopes to become a true Minecraft grass block or at least\na better Minecraft grass block than the other Minecraft\ngrass blocks.\nWow.\nI had no trouble\nsleeping afterward.\nThis morning, I said my goodbyes. To Tufty and Meowz. To\nClyde, Greyfellow, and Batwing.\nGreyfellow gave me more Disguise potions and\nan item called a “compass.”\n“Remember, you’ll want to keep heading east.”\nBatwing gave me a tellstone. “Maybe you’ll be able to\nreach them at some point. Who knows?”\nClyde was crying, Meowz was about to join him, and Tufty\nwas trying his hardest to be brave: “Gonna miss you,\nman. Stay safe, all right?”\n“You know me.”\n“Goodbye, Eeebs,” Clyde said. “Thanks for ﬁnding me.”\n“Thanks for saving my life.”\n“Come back soon, all right?”\n“I will.”\nAnd that was it. The endermage took me to the edge of\nthe city, where he’d built a nether portal.\n“I will be traveling to the Overworld as well,” he said.\n“Yet, I won’t be joining you. I’ll be traveling to the capital,\nAetheria City. If you should journey there, ask\naround for the Library. I’ll be conducting my research\nthere.”\nI nodded.\n“Now, do you remember what you must do?” he\nasked.\n“After I arrive in the Overworld,” I said, “I must head east\nand ﬁnd the village of Shadowbrook. It lies on the\neast coast of the main continent. If instead I reach the\nocean, I should head north until I ﬁnd it.”\n“Good. What will you do if you ﬁnd this village?”\n“I’ll ask to see a girl named Breeze,” I said.\n“Who else?”\n“Runt. Pebble.”\n“Good. And what will you do if you cannot locate\nthem?”\n“I’ll head west, to Aetheria City, and ﬁnd you.”\n“And if you do come across them?”\n“I will tell them they need to abandon their village,” I\nsaid, “and seek refuge in the capital.”\n“Why?”\nI crept forward, trying to recall what he’d told me earlier.\n“Because according to the Prophecy, a dragon is\ngoing to burn it to the ground.”\n“Excellent. It seems your Higher Intelligence\nability really does work.”\n“…”\nI remembered the ﬁrst time I’d stepped into a nether\nportal. The uncertainty I’d felt, then. The fear. The\nhesitation.\nNow, it was much like that, only ten times worse.\nI was afraid of what I’d see and what I might have to face.\nAt last, I stepped in.\nMy vision wavered.\nAll grew dark.\nAs soon as I arrived in the Overworld, I began sprinting.\nAt ﬁrst, everything looked normal. Trees. Tall grass.\nHills and mountains, rivers and valleys.\nWithin hours,\nI found a village—\nor what looked like one to me.…\nI sniﬀed around every building.\nNot picking up any villager scent, I thought. Whatever\nhappened here must have happened days or even weeks\nago.\nYet, within minutes, I caught two new scents. One was\nhuman, the other villager. I soon heard them\napproaching so I hid in some tall grass nearby.\n(My Creep ability must have turned me mostly invisible, as\nthey didn’t seem to notice me.)\nThe human had spiked yellow hair and brown armor,\nand he carried a sword on his back. The villager had a\nhuge nose and carried two swords on his back, one\nsword slightly smaller than the other.\n“I can’t believe this,” the villager said. “It’s just like\nthe last one I saw.”\n“Get used to it,” the human said. “Every place I’ve\ncome across has been like this. Or worse.”\nThe villager suddenly seemed so angry. His rage\nquickly subsided, however, and he gazed at the ruins in\nsorrow.\n“C’mon,” the human said. “Let’s look around and see if\nthere’s anything we can salvage. And stay alert. You\nwouldn’t believe the stuﬀ that’s out here.”\n“I’d believe. I’ve fought a few myself.”\n“Really? Hey. Why are you out here, anyway?”\n“I was exiled.”\n“What’d you do?”\n“I made a wrong decision.… It’s a long story.”\n“They at least gave you a weapon or something, right?\nSome tools?”\n“None. I’d dropped all my stuﬀ earlier. That ﬁrst night, I\nwas jumped by ten husks while trying to dig an\nemergency shelter.”\n“Ouch. Did you even have a sword at that point?”\n“No. Just a wooden shovel.”\n“You fought ten husks with a wooden shovel? How’d you\nmanage that?”\n“I just managed.” The villager paused. “Why are you out\nhere?”\n“Because of this.” The human withdrew a piece\nof paper from his inventory. “Found it in some ruins a few\ndays ago. In a library. It leads to a cave ﬁlled with\nadamant.”\n“What’s adamant?”\nThe human sighed. “I think you’ve been holed up in that\nvillage of yours for way too long. Maybe getting exiled\nwasn’t such a bad thing, huh? Anyway, I’ll show you the\nropes. Just stick with me.” He drew his sword.\n“C’mon. That cave isn’t too far from here. We’ll search\nthis place ﬁrst then hit the cave afterward.”\n“All right,” the villager said. “By the way, you never told\nme your name.”\n“Just call me S,” the human said.\n“S? That’s it?”\n“Well, I know my name starts with an S. I can’t seem to\nremember the rest, though. Anyway, let’s go.”\nThey took oﬀ.\nOf course, I wanted to reveal myself and speak with\nthem, but they looked a little dangerous.\nOnce they were far enough away, I took out my\ncompass and left the ruins, heading east again. For the rest\nof the day, the only thing I found of interest was ﬁre. A\nforest ﬁre.\nIn my dreams, I heard voices.\nThe voices of two girls.\n“Dude. Scouting is totally lame. Nothing has happened for\ndays!”\n“It’s what we’ve been tasked with, Emerald. It’s for the\nsafety of \nour village.”\n“Yeah. I know. I just miss hot baths, y’know? I’m totally\ncaked in grime, these new boots are hurting my feet, and—\nhey, look! Over there!”\n“Is that an ocelot?”\n“Looks like it. What’s up with the blur fur, though?\"\n“What were you saying about nothing interesting\nhappening?”\n“I stand corrected. This is even more interesting than that\nhuman girl showing up at our village. What’s her name\nagain?”\n“ilovedragons1. Why do some of the humans have such\nodd names?”\n“Who knows. Hey, why isn’t this ocelot waking up?!”\nFinally, as I felt something nudge me, my eyes ﬂew\nopen.\n“He’s adorable!” the girl with greenish-blue hair\nexclaimed.\n“Is that even an ocelot?” the other girl asked. “Looks more\nlike a monster to me.”\n“Whatever he is, I say we keep him.”\n“Keep him?! Are you joking?! I thought you\ndidn’t like monsters, Breeze.”\n“Wouldn’t a monster be attacking us by now?”\n“Yeah, I guess.”\n“It’s strange, though. I thought ocelots were afraid of\npeople? Has he already been tamed?” It took a moment for\nthe realization to hit.\nBreeze?! The girl on the left is Breeze?! Is that some\nkind of luck or what?!\nI rose to all fours and yawned. “You don’t need to talk as\nif I can’t understand you. I’m well versed in your\nlanguage.”\nThe girls jumped back. “Um, like, did he just …”\n“You can really talk?” Breeze asked.\n“Yeah?”\n“Why do I feel things are about to get crazy around\nhere again?” Emerald said.\n“I’ve been sent to ﬁnd a girl named Breeze,” I said.\n“Also, two boys. One goes by the name of Runt. The\nother is known as Pebble.”\nThe girls exchanged glances.\n“I don’t understand,” Breeze said. “How do you know\nabout us?”\n“Through our mutual friend. Batwing.”\nHer smile faded.\nEmerald sighed. “Um, is he talking about that skeleton\nyou’ve been dreaming about?”\n“Yes.”\n“Right. Shall we head back now and warn the mayor of\nimpending craziness the likes of which we’ve never\nseen?”\nBreeze slowly nodded at her, before staring into my\neyes. “What’s your name?”\n“Eeebs.”\n“Nice to meet you, Eeebs. May I ask why you were\nsent to ﬁnd us?”\n“It’s a long story.”\n“That’s ﬁne. Would you like to head back to our village\nwith us? You can tell us on the way.”\n“Of course,” I said. “Oh, and now that you mention\nit, I should say that I’ve been instructed to inform you of\nsomething. Regarding your village.”\nThe girls exchanged glances again. “What is it?” Breeze\nasked.\n“All of you should leave before the moon is full,” I\nsaid, “and head to the capital, as according to the\nProphecy … your village is about to be\nannihilated.”\nWhile searching for the village of Shadowbrook, I met two girls named Emerald and Breeze.\nI told them about how I was sent to find them and how, according to the Prophecy, their\nvillage would soon be destroyed.\nCome to find out, I was never going to find Shadowbrook. It was Breeze’s home village, and it\nwas completely wiped out some time ago. She’s one of the survivors who fled.\n“Wait,” I said. “Where are you taking me, then?”\n“Villagetown. We believe it’s the last village still standing on this side of the continent.”\n“Well, the humans say it’s not really a village,” Emerald said, “but a town. And maybe they’re\nright, y’know? It’s changed so much.”\n“It has.” Breeze turned away. We were standing on a large hill overlooking a river, and she pointed at\nsomething far away. I’d never seen anything like it before.\n“Is that some kind of tree?” I asked.\nBreeze shook her head. “It’s one of our watchtowers. It also functions as a beacon. Our\nbuilders constructed them around our village to help the scouts find their way back.”\n“All we have to do is head in that direction and we’ll be home,” Emerald said. “Max came up with the\nidea. A friend of ours. Actually, I guess Runt should get some credit for—”\nI almost jumped when she said his name. “You know Runt?!”\n“Of course,” Emerald said. “He’s part of our group. In fact, he should be with us right now.”\n“Why isn’t he?”\n“He’s currently being punished.” To my blank expression, Emerald sighed. “We recently graduated\nfrom school, and the mayor gave us one last little school assignment. We had to write twenty\npages about our chosen profession. Now, I love my village and all, and I have absolutely zero\nregrets about becoming a warrior, but dude … c’mon. Who wants to write twenty pages about\nanything? Luckily, Runt thought of a way for us to avoid writing so much without breaking the\nrules, and every other student copied Runt’s idea. Needless to say, the mayor wasn’t too thrilled\nabout that. Guess that’s why Runt is back to crafting potato-based food items.”\nResisting the urge to ask, “What’s a potato?” I nodded. “Hmm. Do you think I’ll be able to speak\nwith him?”\n“Probably,” Emerald said. “That is, if the entire village doesn’t freak out upon hearing the bad news.\nBy the way, what kind of dragon is supposed to attack?”\n“I have no idea. I don’t even know what a dragon is.”\n“…”\nAfter the girls took me to their village, I was surrounded by so many people. No one seemed to be\nafraid of me—not even the children:\n“Is that really an ocelot?”\n“It looks more like a monster!”\n“Wow! Where can I get one of those?!”\n“Thanks for the fish,” I said, to a human boy named LazyGiraffe. “An hour of sprinting can really\ndrain your food bar.”\n“You can talk?!”\n“Hey, what’s your name?!”\n“What kind of ocelot are you, huh?!”\nMy introduction to Villagetown went pretty much like that.\nA girl named Ophelia gave Breeze a hug. “Glad to see you back safely. What’s the deal\nwith this guy?”\n“It’s complicated,” Breeze said.\nEmerald laughed. “I’ll say. Just wait until you hear the news.” She turned to Ophelia. “Hey. Your\ndad’s a librarian, right? Ever heard about something called the Prophecy?”\n“I haven’t. Why?”\n“Never mind.” Emerald glanced farther into the village. “I’m out. Time for a bath. See you guys at\nthe meeting?”\nOphelia blinked. “What meeting?”\nBut Emerald only winked before taking off.\n“Um, okay?” The yellow-haired girl turned to Breeze. “What’s going on?”\n“Seems like this kitten came from a city of monsters,” Breeze said. “Good ones.” She reached\ndown and scratched my neck. “Isn’t that right?”\n“I don’t consider myself to be a monster,” I said, “but yes. You are correct.”\n“So, why are you here?” Ophelia asked me.\n“Have you ever heard of someone known as a Savior?”\n“No?”\n“How about Chosen Ones?”\n“Um …”\nThe other villagers looked just as confused.\nMoments later, a man known as the mayor approached, along with many serious-looking men in\nblack clothes.\n“Breeze? What’s going on here?! And … what is that?!”\n“We found him sleeping under a tree. He has a message for us.”\n“Right.” The mayor stared at me without blinking for at least five seconds. “Um. Good work.”\nOne of the men in black robes threw something around my neck—I’d later come to learn that it was\na leash.\nI hissed and tried running away, but whenever I moved more than five blocks away from my\ncaptor, I flew back toward him.\nBreeze moved up to the man. “Father, stop!”\nHe smiled slightly. His eyes were concealed by these weird-looking black things. “You know\nwhat must be done.”\nThey hauled me away to a small, dark room and asked countless questions. The kind of questions\ncautious people ask when a blue kitten suddenly shows up at their village.\nYes, it’s true. And their breath isn’t nearly as stinky as yours.\nI told them everything, but they didn’t believe a word. No one had heard of the Prophecy,\nand as for dragons …\n“The Overworld hasn’t seen dragons for over a thousand years!” the man named Brio shouted.\n“One kind of dragon still lives on, yes, but only in the third dimension!”\n“All I know is what I’ve been told! The enderman gave me this book, and …”\nAfter I talked about the book Greyfellow had loaned me, Brio brought in more villagers. They wore\nwhite robes.\nI came to learn that they were librarians and had in-depth knowledge of this world’s history.\nYet, none of them could recall ever reading about the Prophecy.\n“What about these abilities you speak of?” the mayor asked. “Care to demonstrate them?”\n“Sure.”\nTo their awe, I breathed fire, climbed a nearby cobblestone wall, and turned almost invisible when\nstanding still.\n“If there was a pool of lava nearby,” I said, “I could go for a swim. I’m immune to fire, just like\nthe monsters that live in the Nether.”\nFinally, I summoned my visual enchantment screen. Brio and the mayor recognized it\nimmediately. Amazingly, they had visual enchantments as well. They summoned them using\ntheir mind, the same as I had.\n“Almost every living being has them,” Brio said. “Yet, most are unable to access them. They must\nbe … unlocked.”\nThe two villagers closed their screens, and the mayor looked at mine, which was currently displaying\nmy enhancements. “What’s that?”\n“The enderman enchanted me somehow,” I said, and held up my purple claws.\n“Did he ask you to step into a metallic box of some kind?” Brio asked.\n“You mean a rune chamber?”\n“Yes.” Brio turned to the mayor. “Perhaps he speaks the truth?”\nThe mayor nodded. “Listen … Eeebs, is it? I’m going to call everyone in the village. We’re going to have\na meeting.”\n“You’ll need to tell everyone what you’ve told us just now,” Brio added. For some reason, he was\nsmiling again in that strange way. “I suppose we’ll soon be making yet another alliance.”\nThe man named Drill spoke up. “Tell me this creature is joining our army. Please. I want this thing\non the front lines.”\n“Perhaps he will.” Brio stopped smiling. “One last thing, kitten. Did that book mention the names of\nthe two Saviors?”\n“Yes. But I forgot them. The enderman asked me to remember so many different things. The book\nsaid that one of them was a human. Does that help?”\n“Not exactly.”\nAn hour later, I stood in a fancy-looking area of Villagetown. A countless number of villagers had\ngathered before me.\nWait, no. Roughly half of them weren’t villagers. They looked different … wore different\nclothes. Perhaps they were the humans I’d heard about?\n(Now that I think about it, I’ve seen villagers several times before, back when I was just a normal\nkitten, but I don’t recall ever seeing humans until today. Where’d they come from?)\nThe mayor eventually introduced me and asked me to tell everyone the news.\nI suppose it was strange for them to hear an animal speak.\nStranger still to hear me speak of a city filled with monsters willing to cooperate.\n“The monsters I met know about magic,” I said. “They’re very smart. I believe both sides could\nhelp each other.”\nOf course, there were many who didn’t believe or trust me. Such as a young man who emerged\nfrom the crowd. A human, I think? He looked up at the mayor and called out:\nWhen I saw him, I could sense that there was something different about him. It was the same\nfeeling I got after meeting Greyfellow, Batwing, Brio, Breeze, Emerald.…\nStill, he was different from even them. Stronger, maybe? Was the power I sensed due to him\nbeing higher in level and possessing stronger abilities than the rest? I’m not sure.\n“You certainly have a point,” the mayor said to this human. “We will discuss this at length and have\na vote.”\nThis caused a huge commotion. The crowd only grew louder when the mayor added: “Although\nit’s hard to imagine, there may come a time when monsters live among us an—”\nAn old villager man glared at me and shouted, “The day I live alongside monsters is the day I make\nmy own village! I know how to dig! I’ll make an underground house and start a bat farm!”\nMore villagers joined in:\n“I’m with you, Leaf!”\n“Me too! This is madness!”\n“No one’s even heard of this Prophecy!”\n“If a dragon really does attack, we’ll be ready! We’ve already fended off thousands of\nzombies!”\n“Working with monsters?! How can anyone suggest such a thing?! Do you not remember the\nattacks?!”\n“No mobs allowed!” someone screamed.\n“Yeah! No mobs allowed!”\nRoughly half of the crowd began chanting this phrase. Then someone threw a carrot at me. This\nwas followed by some seeds, an apple, and, finally, a loaf of bread.\n(I ate the bread, topping off my food bar, so the joke was on them.)\n“Stop this at once!” the mayor shouted. “We cannot ignore what this animal has to say! If\nthere really are good monsters out there, we must consider forming an alliance!”\nHe left the raised platform and stood next to me. “Even though he is an animal, he appears to be\nquite intelligent, and he will be treated with respect for as long as he stays here! Understood?”\nThere were many grumbles, weak attempts at protest. But just as many people walked up to me.\nIncluding Breeze.\n“I’d like to take him around and teach him more about our village,” she said to the mayor. “Is that\nokay?”\n“Only if Eeebs agrees to it.” He sighed. “Kitten, I’m sorry for their outburst. We’re a little\ndistrustful of monsters. That being said, do you really wish to stay here for the time being?”\n“Why not? I like being held.”\n“Very well. In the meantime, our librarians will do more research. We’ll see if we can shed some light\nupon this mysterious Prophecy you speak of. And you’ll be able to speak with Runt after he’s …\nthrough with his punishment.”\n“Thank you.” I suddenly remembered the human’s words. “Sir.”\n“I’m exhausted,” Breeze said to her father. “I’ll take him back to our house and show him\nVillagetown tomorrow.”\nAs she turned around, holding me in her arms, she bumped into another person. A villager in a\ndark red robe. A bunch of white hair hung from the lower part of his face, and he was wearing a\nhuge red hat and the same black things Breeze’s father wore. You couldn’t see much of his face.\n“Sorry,” he said. “Forgive me, my lady.”\nShe stepped closer to him. “Hey, don’t I know you?”\n“N-no, no. I … no, I don’t believe we’ve met before. Yes, certainly I’d remember a damsel such as\nyourself!”\n“What’s your name?”\n“My name?” He paused. “Korbius!” He nodded profusely. “Yes, that’s my name! Korbius\nWijjibo!”\n“I don’t recall ever seeing you in Villagetown before.”\n“Of course not, for I am … a traveling merchant! Yes! A merchant who travels! That’s\nmeeee!” He bowed. “Would you like to trade?”\n“No thanks.” Breeze lingered in front of him for a moment, her brow furrowed, then carried me off.\nIt was strange, the way she acted.\n“What’s wrong?” I asked, still purring.\n“Nothing.” She glanced back at him. “Guess I’m just paranoid.”\nWhen we entered Breeze’s house, I was shocked at how small it seemed. Compared to Greyfellow’s hut, it\nwas tiny. Her bedroom was five blocks wide.\nI sat down on the carpet. “Is it really so hard to believe that good monsters exist?”\n“We’ve been through a lot,” she said. “Monsters attacked several times already, and some of us were\n… well … we’ve lost people.”\n“I’m sorry. Then I guess I can understand why they’re so distrustful.”\nI sniffed around and saw a book lying on top of a raised flat surface. It was a diary, just like\nmine.\nWhere did she learn how to draw like that? I’m so jealous.\nShe rushed over and closed the diary before I had a chance to really look at the drawing. Her\ncheeks were so red!\n“That’s Runt, right?”\n“Yes. You’ve … seen him before, haven’t you?”\n“Yeah. Using one of these.” I withdrew the tellstone from my inventory and told her about it.\n“That explains a lot,” she said. “I was beginning to think Herobrine was behind those dreams.\nMaybe we could use this tonight to speak with Runt?”\n“Maybe. Batwing said his tellstone didn’t always work, though. Tellstones should be able to\ncommunicate with anyone, sleeping or not. But they’re hard to craft. The enderman is still\nworking on perfecting them.”\n“Well, if it doesn’t work, you can always speak to Runt in person. He’ll be free in a few days.”\n“Do they always punish him like that?”\n“No, it’s just … he’s a captain, now. A leader. Kind of. So the mayor wants him to set a good\nexample. A lot of the younger kids look up to him now.”\n“Oh.”\nLater that night, we tried using the tellstone.\nI pictured Runt in my mind, but nothing appeared. Then, for some reason, I thought of that villager\nI’d seen yesterday. The crystal immediately lit up:\nThe images disappeared. The purple gleam returned to the crystal’s surface. I pawed the tellstone\nevery which way, but the images wouldn’t return.\n(I’m not positive on this, but I believe he was having a nightmare and woke up, which severed the\ntellstone’s connection.)\n“That was Pebble,” Breeze said. “So … did we just witness his dreams or something?”\n“I think so.”\n“Didn’t think he was still alive.”\n“He is,” I said. “I saw him yesterday. Before I met you.”\n“Where?”\n“In some ruins. He was with a human. They were searching around for a cave.”\n“So, he really did survive.…” She said something after this, but so quietly, as if speaking to herself.\n“He must have learned how to use abilities, too.”\nWell, I think that’s what she said.\nOr did I just imagine her saying that?\nBreeze gave me a tour of the village today.\nWhile we walked through the streets, I noticed these large pieces of paper called “posters.” They\nwere everywhere. Someone must have put them up last night.\n“Seems like at least a few people haven’t forgotten the meeting,” I said.\n“It was hard enough getting everyone to agree to let humans stay here. I’m not so sure we’ll ever\nbe able to form an alliance with monsters.”\n“Well, we’ve got to try. They’re really so nice. You’d like them.”\nWe soon forgot about the posters, because a villager in white robes ran up to us.\nMax. He’s a warrior like Breeze, but he once had interest in becoming a librarian.\n“I’ve read nearly every book in the village,” he said, “and found nothing relating to the\nProphecy. However …”\nHe held up a book (History of Minecraftia, Volume II) and turned to somewhere in the middle.\n“Look. Someone tore out three pages.”\nBreeze ran her fingers across the jagged edges. “Why would they do that?”\nMax shrugged. “Maybe it said something about the Prophecy? But who would want to hide that?\nThe mayor?”\n“No, I don’t think so,” Breeze said. “Wait. Where did you get this book?”\n“The main library. I’ll go there again tomorrow and double-check for any other books that might\nhave been tampered with. Wanna join me?”\n“Sorry. Today’s my only day off this week, and I’m supposed to show Eeebs around.”\n“It’s cool. Emerald’s off tomorrow. I’ll ask her.” He glanced at me. “Really wish you could’ve brought\nthat book you were talking about.”\n“I could always go back for it,” I said.\n“You might have to,” Max said, “if nothing turns up.”\nMax then took off, and Breeze showed me so many different places.\nIt almost felt like someone was watching us. But I didn’t see anyone.… One street had something\nreally weird. A villager did something known as a “farming fail.”\nHours later, as Breeze explained the combat cave to me, that Drill guy ran up to us.\nHe screamed so loudly, asking Breeze if she was done accompanying “His Royal Fuzziness”\naround. Was he talking about me?!\n“You want a little tour of our village, huh?” He pointed down a street. “See all those people building\nand farming!? That’s called hard work! You’ll be joining them if you wanna stay here! Now\nmarch!”\nDrill thinks I need to be trained. Long story short, I’ve been asked to help out. If I want to stay here,\nI must become a useful member of the village.\nThey seem to think I’d make a great scout. That means exploring beyond the wall. But scouts\nshould know all the basics, such as mining, crafting, and farming.… It’s dangerous, being\na scout. They say the monsters outside are growing stronger. It’s an important job, too, because scouts\nare supposed to search for resources like iron.\nIt seems that iron is really important to these villagers. They use it to make weapons, armor, tools,\nand even defenses such as doors and gates. The problem is that iron comes from the ground, and\nthey’ve already mined most of the ground beneath the village. They say they don’t want to go any\ndeeper because it’s too dangerous.\nFood is also a concern. A large number of humans arrived some time ago. The farms here can\nproduce only so much food. Right now, people are consuming more than can be grown. So they\nneed to make more farms. They’ve used up almost all the land within the walls, though, which means\nthey must start farming outside.\nAs we followed Drill through the streets, he kept yelling at random villagers, telling them to build\nfaster, work harder: \n“You’re lollygagging like Stump in a kitchen! Like Runt at the ice cream stand! Like Emerald in the\nClothing Castle!” In a much calmer voice, he said, “In fact, I bet that’s where I’ll find her. Come on,\nkitten. Let’s go say hello to your new teacher.”\nI saw Brio and the mayor at one point. They were yelling at workers as well. The word “efficiency”\nwas often brought up.\nEfﬁcient use of space. Proper building techniques. What are they talking about?! I don’t even know\nwhat a crop is!\nLater on, Drill took us to this place called the Clothing Castle. Apparently, Emerald really does spend\na lot of time there.\n“How did I know I’d find you here?” Drill said.\nEmerald glanced sideways to the left and right without moving her head. “Oh! Are you talking to\nme? Need some fashion advice, huh?”\n“Hardly. Since Breeze will be scouting tomorrow, and since you’re off tomorrow, you’ll be the\nfirst one to teach this kitten. Help him get up to speed. Show him how to farm.”\n“What? But I was supposed to go fishing and—”\n“What’s that? You said you’re ready to do five thousand laps around the combat yard?”\nShe flashed a smile. A nervous one. “Did I say fishing?! It’s been a long day! What I meant was\nI’d be honored to teach Eeebs! Where should I begin?”\nEmerald taught me how to farm today.\nI personally think it went very well, but she seems to think otherwise.\nHey, it’s not my fault. Her instructions weren’t very clear to me. As if a kitten would know\nanything about planting seeds!\n“Dude! Don’t be in such a rush! You need to place seeds in farmland!”\nShe took me to a grassy area where she demonstrated how to use this farming tool called a\n“hoe.”\nStanding on my hind legs again, I turned three blocks of grass into farmland and planted some\nseeds. I felt so proud of myself. She didn’t, though.\n“Farmland should be close together,” she said. “There’s no need to have it all scattered around\nlike that.”\n“Right.”\n“Dude? Where’s the water? You really need to listen!”\nShe told me again about how crops need to be watered, or irrigated. Otherwise, they won’t grow\nnearly as fast.\nI did pretty well, all things considered. She gave me a bucket, and I scooped up some\nwater. I just forgot about the “digging a hole for the water” part.\nA minor setback, nothing more!\n“I’ve seen a lot of farming fails, but wow. Just wow.”\n“Isn’t diversity a good thing, though?”\nAll right, I’ve got this farming stuff ﬁgured out. BRB, time to ace the rest and become the ultimate\nfarming champion.\n“Come on! Crops need light to grow! You can’t just build a wall around them!”\n“Okay! Okay! I’m sorry! I just want to talk to Runt, okay? It’s part of my quest! I can’t stop\nthinking about it!”\n“Yeah? Do you have any idea what they’ll make us do if they catch us sneaking up to him? You’ll\nsee Runt when he’s no longer crafting baked potatoes, okay? Just follow the rules!”\n“Fine!”\nUsing a pickaxe, I began tearing down the wall.\n“Good kitten. Now, what you should do is build a fence. Here, I’ll place the crafting table again\nand …”\nFor the first time today, Emerald smiled. “Good job.”\n“How about a hug, huh? Or you can just scratch my chin. I’m not picky.”\n“I’ll pet you once we’re finished. Now listen up. Okay, so, crops need light, right? But what happens\nwhen the sun goes down? How can you provide light for your crops during the night? Any ideas?”\n“I think so.”\nEmerald facepalmed. “We’re done for the day. And tomorrow, Stump will be teaching you how\nto craft, not me.”\n“Okay. By the way, where’s my hug?”\n“As if! Hurmmph!”\nEmerald stormed off. Later, a nice girl named Lola taught me how to shoot this weapon called a\n“bow.”\nThe other villagers say she used to be very unskilled, but she’s recently shown promise. She\nalso crafted a hat out of a creeper she dropped in the wild.\nNessa “Lola” Diamondcube\nfrom Noob Extraordinaire to Scout First Class.\nThis morning, I met the villager known as Stump. One of Runt’s best friends.\nHe wasn’t too happy about having to teach me on his day off. Part of the problem was that I kept\neating the crafting ingredients.\nHe called me a walking garbage can, because according to him, it’s not even possible to eat some\nof those ingredients. Our time together can be summarized by a single picture:\n(I’d include pictures of my various crafting fails, but at this point, I’ve become somewhat embarrassed\nof my complete lack of skill.)\nI guess Stump takes his crafting seriously—especially food items like cakes—so when I basically\ndecorated the floor with ingredients, his anger only grew.\nLuckily, Max interrupted us before long. He just burst through the door, muttering something\nabout books and libraries and the biggest mystery the village has ever seen.\nSeconds later,\nwe were out the door.\nMax took us to one of Villagetown’s libraries—the biggest one in the village.\n“I’ve been doing a lot of research here,” he said, leading us past the bookshelves. “I found a book\nwith missing pages in one of the back rooms.… But I didn’t notice the carpet until this morning,”\nhe said.\nStump glanced around. “What’s wrong with it? Besides that awful orange color, I mean.\nSeriously, who decorated this place?”\nMax walked farther into the room, then stopped. “Come over here.”\nWe followed. As an animal who’d only just learned how to farm, I had no idea what was going\non. But then, I didn't feel too bad, because Stump didn’t seem to understand either.\nMax pointed at the floor.\nCarpeting made from a sheep’s wool and dyed bright orange.\nThat should have been nothing more than a decoration, something placed over cobblestone.\n“Feels a little soft,” Stump said, stepping on to one section of the carpet. “Spongey, really. Almost\nlike a cake. What, is there nothing underneath?”\nMax mined the carpet up with his bare hands.\nMax thinks it’s been here for a very long time.\nWhat sat inside were more bookcases, a chest filled with all kinds of papers and scrolls … and a\nmassive tome, lying on a table.\nAlthough it looked like nothing more than a large book with a dark gray cover, there was\nsomething about it—the more I stared, the more I sensed the power it contained.\nMax lifted the tome up in a way that suggested an immense weight. Record of Aetheria was\nits name. “It just goes on and on. It’s over five hundred pages long.”\n“Five hundred pages?!” Stump moved closer and eyed it suspiciously. “Of what?”\n“The history of the world. The Prophecy, too. And guess who’s name is in here?”\n“Breeze?”\n“No. Kolb.”\nI zoomed over to take a better look at the tome. “He’s one of the Saviors, right?”\n“Apparently. I’m wondering why he never told us?”\n“Maybe he doesn’t know?” Stump said.\nMax shrugged. “It gets weirder. One of the things I’ve read … we’re supposedly controlled by some\nkind of guiding force called AI.”\n“I’ve heard that before,” I said.\nMax turned to the first page. “There’s also this.”\n“Whoever wrote this clearly didn’t want Herobrine reading it,” Stump said. “That must be why it\nwas stashed here. But who wrote it?”\nMax turned to the next page.\n“We have to ask Kolb about this,” Stump said. “He has to know something.”\nMax nodded. “I’ll go see if I can find him. You two wait here. And Eeebs? Wipe that sugar off your\nnose. Seriously, man. Are you a kitten or a pig?”\nTen or so minutes later, Kolb entered the cramped little room.\n“There’d better be a good reason for bringing me down here,” he said. “I really—” He paused when\nhe saw me. “Oh. So it’s about that. How many have you told, kitten?”\n“No one. I couldn’t remember your name.”\n“So you already know?” Max asked.\n“Yeah.”\n“Can you please just tell us what’s going on?” Stump asked.\nThe human sat down on a bookcase. “I can tell you what I know. Of course, for the safety of\nyour village, you must promise never to tell anyone else. Not even the mayor. Agreed?”\nTwo villagers and a kitten nodded their heads in unison.\nKolb sighed. “You know, I used to laugh at myself for talking with what I once considered to be\nNPCs. But now … whatever. Here it goes.”\nAnd so, he told us his story.\nThe human named Kolb once lived in a world known as Earth.\nHis life was fairly boring back then. He went to school, did homework, studied. He also played\ngames.\nThe games he played utilized a technology known as virtual reality. You threw on a helmet-\nlike device, and it seemed like you were in another world.\nHis mom was always working, and he’d never known his father, so he often escaped into games to\nnot feel so alone. His favorite place was a virtual reality Minecraft server called Aetheria.\nThat world is this world. Or used to be.\nMax didn’t seem to believe him. “You’re telling me … we’re just game characters?”\n“I don’t know,” Kolb said. “We still don’t know for sure. We’ve had countless arguments over this,\ntrying to figure it all out.”\n“Well, what happened?” Stump asked. “You said this game you played was normal, right? Everyone\nplayed it. So what changed? Why are all the humans always freaking out?”\n“Umm … it’s like this.…”\nThe human then shared more of his story.\nIt was the year 2039, and his world was in a similar situation as our own: suffering from a\nterrible war. One day, weapons capable of unparalleled destruction were sent through the air,\ntoward his homeland. When this was announced, he was alone.\nIn the eyes of many, the world was about to end. So Kolb, wanting to at least see his friends one\nlast time, entered the virtual reality world of Aetheria. To say goodbye.\nThere, he met his best friend, Ione, as well as one of the game’s administrators, Entity.\nHowever …\nWith the world’s destruction just minutes away …\n“I blacked out and woke up still in the game,” he said, “unable to log out. We call it the\nevent. Many of us think there’s a scientific explanation for what happened. Yet, just as many\nbelieve in the impossible.”\nMax looked up from the massive tome. “You mean magic?”\n“Yeah. I guess so. I’ve never believed in that kind of stuff. Still don’t. Yet … some humans think\nEntity is a wizard who whisked them away to safety just before the world ended.”\n“So that’s why you guys have those arguments,” Stump said. “Some of you call yourselves\nBelievers, and others are Seekers. I never understood why until now.”\n“If we really are game characters,” Max said, “does that mean we’re not really alive? We’re just\nlike … golems, or something? Following instructions of some kind?”\nThe human shrugged. “We’ve spent days discussing that. In the end, each of you seems very real, so\n… it really is like the game magically came to life.” He sighed. “Look, guys. I’m just telling you what I\nknow, and what I know isn’t much. It took me a long time to come to terms with this. But I’ve finally\naccepted it. It is what it is.”\n“I don’t meant to interrupt,” I said, “but I’m starving. Maybe we could talk more over dinner?”\nThe other three looked at me as if I’d just asked if they wanted to help build a snow fort in the\nNether.\n“It’s not even lunchtime,” Max said.\n“Oh. What can I say? I’ve been living in the Nether. Having no sky kinda messes with your sense of\ntime.”\nStump retrieved a strange-looking item from his inventory and placed it on to one of the\nbookcases. It had a familiar scent.…\nI sniffed again. “What is that?!”\n“A stormberry cake,” Stump said. “My finest creation.”\n“See, that’s what I don’t get,” Kolb said. “All this new stuff … it doesn’t make any sense.”\n“What do you mean?” Stump asked.\n“Well …”\nKolb went on to explain that the game server, Aetheria, was drastically different from normal\nMinecraft.\nMinecraft had changed a lot since it was first created—thirty years and still going strong—\nyet, the Aetheria server ran a mod, which further altered the game’s rules.\nStormberries were one of the countless new things the mod included. They grew on leaf blocks\narranged to resemble bushes. And these blue and yellow berries could be used to craft a variety of\ndifferent food items: stormberry cookies, stormberry tea, stormberry rolls and biscuits.…\n“But not cakes,” he said. “That crafting recipe just wasn’t in the game’s code. Someone had\nsuggested it on the forums once, but Entity never programmed it in. Some of us figure that\nwhatever happened during the event not only trapped us inside but also somehow unlocked a beta\nversion of the server. A new update that Entity was working on.”\n“You’ve lost me,” Max said. “All right, forget all that. What about you being a Savior?”\nKolb took a deep breath. “Entity added these things called quests. Like, you talk to a villager,\nand the villager asks you to fetch him some lava or something. Boom, you’re on a quest. So you go\nscoop up some lava in a bucket, give it to the villager, and he gives you a reward of some kind, and\nthe server rewards you with experience points, and the quest is complete. Right, anyway, um, I guess\nI was given a special quest. Quests come in three different types. First, there’s your ordinary\nquest. Simple ones like fetching a villager something. Then there are quest chains. You complete\none quest, it leads to another, which leads to another. Finally, you have quest trees. They’re more\ncomplicated, nonlinear. Me being a Savior is all part of one big quest tree.”\n“And what are you supposed to do?” I asked.\n“I have to re-forge this.”\nHe pulled out a sword from his inventory. Its blade seemed to be broken.\n“I recognize that metal,” Max said. “That rainbow effect … that’s adamant, isn’t it?”\n“Yeah. This is Critbringer, one of the swords crafted by Entity thousands of years ago. He\ngave it to me in-game before everything went black, said it was one of the most powerful\nquest items ever made.”\nStump didn’t seem too impressed: “If it’s so powerful, why is it broken?”\n“It’s just part of the lore. Entity wrote detailed history for the server. According to the story,\nHerobrine tried to destroy the blade during the Second War. Now, seven fragments are\nsupposedly scattered across the world. Shards, they’re called. Upon finding one, I can forge it back into\nthe blade by re-crafting it. Each shard added will slightly upgrade the sword’s abilities. Damage and\non-hit effects, attack speed, all that. The problem is locating the pieces.”\n“I saw one!” I blurted out. “A few days ago. In the Nether.”\nI told him about Rarg and how he had taken EnderStar’s secret treasure horde.\nThe human listened intently. “I have to say, I’ve been too preoccupied with the events here. Perhaps I’ll\npay them a little visit?”\nMax opened the huge tome again. “You mentioned something about Herobrine trying to destroy the\nsword. Look. It’s all right here in this book.”\n“That’s the lore.” Kolb moved over and flipped through the pages. “But it isn’t complete. The full\nlore is over one thousand pages long. Entity wrote this stuff over two years ago. When he\nbecame too busy with programming, he appointed several players as scribes to keep adding to\nthe story.”\n“But you said Entity crafted that sword thousands of years ago,” Stump said.\n“Right. After the event, it’s almost like whatever was written down in the lore became reality\nhere.”\n(Um. Wow. Whenever I level-up, I really need to put more points into Higher Intelligence, because I\ndon’t understand much of anything.)\nAs far as I can grasp:\nThere was a virtual reality game on Earth known as Minecraft.\nThe world was coming to an end, so Kolb retreated into the game to say goodbye to his friends.\nAs their final hour approached, the event took place—everyone in the game blacked out and woke\nup here, and the game mysteriously came to life?\nI glanced at the stormberry cake. “Can I eat now?”\n“Sure.” Stump handed me a slice. “Nothing better than home-crafted food.”\nAfter a cautious sniff, I ate the slice in a single bite—and promptly spit out crumbs. “Is … that\n… really … food?!”\nThat was Stump’s tipping point. He was already in a bad mood after I devoured half a stack of\nhis sugar (sugar he crafted using his mom’s special recipe, a family secret passed down through the\ngenerations), but insulting his crafting like that? It was almost as if he was a creeper in a villager\ncostume ready to explode.\nThis morning, a boy named Bumbi taught me how to build.\nAt least, I think.\nMy goal was to build a chicken house behind the school. (I think it’s called a “chicken coop,” but\nBumbi kept saying “chicken house.”)\nThen he stopped giving me oak blocks. Because he ran out. (Is he really a teacher? Shouldn’t a\nteacher be more prepared?) Luckily, he had some cobblestone.\nWhen he ran out of that, he gave me some gravel. When he ran out of that, he gave me some\npumpkins.\nOak stairs are much better for roof building, he said. And when you run out of stairs, well …\nyou’d better use fence. Yeah, that’s it.\nOh, but wait! Every good chicken house needs a door, right?\nLater on today, I caught up with Breeze again.\nShe could sense that something was wrong. She kept asking me what was on my mind.\nAnd she knew that it was more than just that horrible building experience with Bumbi. She knew\nit was something serious.\nI wanted to tell her about what I’d learned yesterday with Kolb, but I’d promised not to say\nanything. Are we really living in a game? Am I just one of its characters?\nIf I really am just a so-called NPC, how am I able to think and feel … ?\nAnd what about my memories? My past life? Endless days just being a playful kitten—are all of\nthose memories false?\nI’m determined to learn more about my existence. I want to know who I am. What I am. There\nmust be a reason for all of this. For this world. For me.\nAnd suddenly I recalled what Rarg had said to me. Sometimes, he doesn’t feel real. I feel the same\nway when I’m tired or stressed out. Could it really be that I’m nothing more than … ?\n“It’s nothing,” I said. “Just had a … bad day.”\n“You sure?”\n“Yeah.”\nAs we wandered through the streets, I noticed that strange old man again. Korbius.\nBreeze spotted him, too. It was pretty hard not to, honestly. He was just ten blocks away, hiding\nbehind some flowers.\nBreeze swiftly moved up to the rosebushes. “Why are you spying on us?”\nThe man stepped back, flustered. “What? Me? Spying on you?! Why no, I was simply …\nadmiring these flowers! Yes! I love flowers! I’m a real connoisseur!”\n“Oh? Then tell me: What color is owl’s eye?”\n“Well, hmm … I don’t believe I’ve ever heard of such a flower. Could it be that I’ve met someone more\nknowledgeable about flowers than even myself? I find that hard to believe!”\n“Just tell us why you keep following us,” Breeze said. “I saw you at the school. The Clothing\nCastle, too.”\n(Really? She must have fantastic eyesight, because I didn’t see him then. Although I did get the feeling\nthat someone was watching us.)\n“Merely a coincidence,” he said. “After all, I am a traveling merchant. I’m always moving\naround!”\n“Whatever. See you around.”\nWhen she said this, Korbius smiled and said, “Oh, yes. I will be seeing you again. Count on\nit.”\nBreeze stared at him for a moment, then turned to me. “Come on. Let’s go.”\n“What’s with that guy?” I asked. “Was he really following us?”\n“Yes. Listen, I need to go speak with my father. Maybe you can go have a rest now that your\ntraining is complete. See you back at the house?”\n“Okay.”\n“By the way,” she said, “my father agreed to let me adopt you.”\n“Adopt? What is that?”\n“It means my house is your house now.”\n“Forever?”\nShe smiled. “Forever.”\nLast night, I had horrible nightmares.\nI kept dreaming about what that human had said.\nAnd Runt. When will I meet him? What will happen once I do?\nI woke up in the middle of the night and tossed and turned on the carpet of Breeze’s room. She\nwas stirring in her bed, perhaps having nightmares as well.\nI’m not sure why, but … I tried using the tellstone again. When I did, a variety of images flashed\nacross the crystal’s surface, from many different people, in many different places.\nCube Kid is the pen name of Erik Gunnar Taylor, a writer who has lived in Alaska his whole life. A\nbig fan of video games—especially Minecraft—he discovered early that he also had a passion for writing\nfan fiction. Cube Kid’s unofficial Minecraft fan fiction series, Diary of a Wimpy Villager, came out as e-\nbooks in 2015 and immediately met with great success in the Minecraft community. They were published\nin France by 404 éditions in paperback and now return in this same format to Cube Kid’s native country\nunder the title Diary of an 8-Bit Warrior. When not writing, Cube Kid likes to travel, putter with his car,\ndevour fan fiction, and play his favorite video game.\n \n \n \n",
            "image": "books/images/Tales of an 8-BIT Kitten (Lost in the Nether) - Copy_page1.png",
            "flipbook": "books/Minecraft/Tales of an 8-BIT Kitten (Lost in the Nether) - Copy"
        }
    ]
}